[{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Director: KIFA verifying organizational progress ","body":" Director: KIFA verifying organizational progressIn an attempt to verify the organizational success of Kole Intellectual Forum; as it has always been the ways of verification of the organization for the last eight years of its operation that is, since 2016; the annual meeting of the organization have directed the Directors (non-siting ones, each one of them) to at least come and verify the successes of the organization and where necessary to advise the management of the areas that needed the correction.Their direction of verification are on these areas:","teaser":"Their direction of verification are on these areas:","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"post@david-dicke.de","title":" Plan to redesign the project: through consultation ","body":"Plan to redesign the project: through consultationKole Intellectual Forum is at the virtue of redesigning one of its project to suit the interest of its community; but, they cannot do so without consulting the community about it. The project of Establishing a Health facility in Kole District is being built on that of to Empower a Girl: For Self-Reliance; and the interest of the program officers of the organization with the approval of the members of the Board have so far approved the editing of the project; however, the Board members have again called for the community involvement for the finally commitment to be submitted to GlobalGiving for the final approval.The project details are as follows, under review by the community at present:PROJECT TITLE  Promoting Real Families through Home Economics  PROJECT SUMMARY  Promoting real youthful families in Kole District can be possible: if at all, Kole Intellectual Forum identify their members and train them with the basic knowledge of home economics that will help them to make up a workable household budget, plan and care for themselves; transforming them from the ancient type of families to the modern ones of real families through home economics.  WHAT IS THE PROBLEM?  …since, most of the members of these families in Kole District lack the basic knowledge of home economics that could have helped them to make up a workable household budget and care for themselves; to create a better standard of living to many, Kole Intellectual Forum therefore intends to address this problem by training these members on how to embrace modern families whereby love, respect, and support exist other than the ancient type whose relationship are based on blood, marriage or adoption     HOW WILL THIS PROJECT SOLVE THE PROBLEM?  Kole Intellectual Forum aims at realizing unconditional love and support from the members of real families project in Kole District as opposed by the ancient type of families; members of real families under this project will practice to each other how to exercise mutual respect and genuine love, provide security and recognizing a sense of belonging, give open communication, as well as making each person feel important, valued, and esteemed.  POTENTIAL LONG-TERM IMPACT  In the long term, families in Kole District will learn how to live a good and a healthy life, in their communities, nation or even go beyond. Above all, they will also learn how to care for themselves, become self-reliant, make up a workable household budget, plan and care for themselves. Hence, influencing a greater percent of families within the district to transform their lives from the ancient type of families to the modern ones where love and support for each other exist unconditionally.","teaser":"Plan to redesign the project: through consultationKole Intellectual Forum is at the virtue of redesigning one of its project to suit the interest of its community; but, they cannot do so without consulting the community about it","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Promoting gender equality among youth ","body":"Promoting gender equality among youthAlthough, Kole Intellectual Forum at present is concentrating on a program that empowers a girl child for self-reliance (https://goto.gg/31562:) in Kole District, Northern Uganda; the organization on the other hand, to certain extent, in its program to be establishing a health facility in Kole District (https://goto.gg/62863) is not forgetting to design relevant program that may embrace empowering boys also to help them address the issue of gender equality; for instance, the organization is addressing the root causes of gender inequality and providing the young people with the necessary skills, knowledge, and opportunities, by cultivating a generation of empowered individuals who can contribute positively to their communities and break the cycle of gender-based discrimination.A three days’ workshop was organized by the organization to train both girls and boys within the area on how avoid to contract sexually transmitted diseases and in case of danger; they were also advised or informed of the available areas to access the treatment in the health facilities; particularly, in the nearby health facilities.  ","teaser":"Promoting gender equality among youthAlthough, Kole Intellectual Forum at present is concentrating on a program that empowers a girl child for self-reliance (https://goto  ","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Rahma's story completed with you. Did you know? ","body":"What comes to mind when you hear the name \"Rahma\"? This word, which signifies kindness and compassion, holds a profound meaning. Have you ever thought about its deep impact? Let us tell you her story…Rahma, a young girl of eighteen, has carried a dream with her since her father first gave her this name. She aspired to become a doctor, embodying her name’s essence, to be a true source of mercy for the weak and the needy. But fate was harsh; she lost her father and found herself surrounded by despair, far from school, in a place where dreams seemed out of reach. Then, you stepped in! And her story began anew.Through your support and generosity, Rahma returned to school, a smile brightening her face, and a spark of determination glowing in her eyes. She is rebuilding her dream, striving to become the doctor her father always wished to see. Her return to school has become a story of hope, not just for her, but for her siblings, her neighbors, and her entire community.Today, Rahma’s dream is no longer just her own; it’s a beacon of hope inspiring her siblings, friends, and community. Every time she sits down to study, she carries a message within her—that the world can be a more compassionate and humane place.Imagine the profound impact of your support now. Imagine how the word \"thank you\" from Rahma’s heart holds a thousand meanings... This gratitude is for you because you were not just a supporter; you were her mercy, the one who revived her dream.Links:","teaser":"What comes to mind when you hear the name \"Rahma\"? This word, which signifies kindness and compassion, holds a profound meaning She aspired to become a doctor, embodying her name’s essence, to be a true source of mercy for the weak and the needy Then, you stepped in! And her story began anewLinks:","charity_project":"Save the Children"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" An Unforgettable Impact! ","body":"Imagine a generation raised on the values of giving, seeing every act of volunteer work as an opportunity to make the world a better place!This is our goal in the Student Activities Pathway: to build a generation imbued with values and responsibility.In an interactive session prepared by the Masar team, our students gathered in an encouraging environment to explore the meaning and impact of volunteer work. It was an inspiring experience that showed them how small actions can make a real difference. They discovered the benefits of volunteer work for individuals and the community and how a volunteer can be a source of inspiration and positivity.During this session, our students embraced core values that help them become role models in giving—values like commitment, honesty, and integrity. They learned the importance of equality and that respect is a right for everyone. They also understood that protecting others' privacy is a fundamental part of integrity and that true giving aims not at personal gain but at making a genuine difference.Our students left the session with a renewed spirit and a deeper understanding of what giving truly means, becoming more aware that real change starts from within. These values they’ve acquired are not just lessons but a message they carry forward to others.Perhaps you share this goal with us. Perhaps you’ve experienced these moments when you saw your efforts bear fruit in our students' lives. Together, we take great strides toward building a society rooted in human values—a society shaped by volunteers like you, carrying the message of goodness in their hearts.From the bottom of our hearts, thank you for your commitment and partnership.Links:","teaser":"Imagine a generation raised on the values of giving, seeing every act of volunteer work as an opportunity to make the world a better place!This is our goal in the Student Activities Pathway: to build a generation imbued with values and responsibilityPerhaps you share this goal with usLinks:","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" For Peace and Development: Your Impact Begins Now ","body":"Who among us doesn't wish to leave a lasting positive impact in a world that longs for stability? Thanks to your support, Masarat has made a true difference, providing education to over 50,000 students in Northern Syria, opening new doors for a brighter future.Imagine that every lesson a refugee child receives or every new skill a young adult acquires could be the foundation for a transformed future—not just for them, but for an entire community. But your support reaches far beyond education...Through an integrated knowledge system, we help young people achieve self-sufficiency, enabling them to transition from recipients to contributors, capable of earning their livelihood with dignity. Masarat's programs have gone beyond imparting knowledge, granting thousands of young people the skills and independence they need. Today, these youth are not just learners; they are potential leaders, entering the job market with confidence and readiness, contributing to a stronger and more cohesive society.Because peace begins with the simplest opportunities—a hand extended with hope and a community growing in stability, We celebrate your impact on the International Day of Science and Development for Peace; your support has made education a tool for building peace, offering hope, and fostering stability.With you, and every hand that gives, we build stronger, more connected communities together, toward a safe and sustainable future.Links:","teaser":"Who among us doesn't wish to leave a lasting positive impact in a world that longs for stability? Thanks to your support, Masarat has made a true difference, providing education to over 50,000 students in Northern Syria, opening new doors for a brighter futureLinks:","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"post@david-dicke.de","title":" Your Support Brought Little Qamar Back to Life! ","body":"Dear Supporter,Because of your kindness, Little Qamar’s story turned from one of danger to one of hope. She arrived at SEMA Hospital with a dangerously high fever, her tiny heart fighting to survive. Suspected meningitis had placed her in critical condition, and every moment mattered.Your generosity empowered our doctors to act swiftly, transferring Qamar to intensive care. In the days that followed, our medical team stayed by her side, finally diagnosing her with acute bronchitis and providing the life-saving care she needed.Now, after a long and courageous fight, Qamar is breathing easier and looking forward to reuniting with her family—all thanks to your compassion.In northern Syria, many children like Qamar still face life-threatening illnesses without access to care. Your continued support could be the difference for another child in need.With heartfelt gratitude,Links:","teaser":"Dear Supporter,Because of your kindness, Little Qamar’s story turned from one of danger to one of hope She arrived at SEMA Hospital with a dangerously high fever, her tiny heart fighting to survive Suspected meningitis had placed her in critical condition, and every moment mattered","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"post@david-dicke.de","title":" You Gave Baby Adnan a Fighting Chance at Life! ","body":"Dear Supporter,Just moments after birth, Baby Adnan was fighting for his life. Born late, his arrival put both him and his mother at extreme risk. But thanks to your generosity and the immediate action of our dedicated doctors at Al-Ikhaa Hospital in northern Syria, Adnan was rushed to the intensive care unit, where they discovered a life-threatening blood infection and severe respiratory distress. Swiftly, treatment began, stabilizing his breathing and battling the infection. Today, by the grace of God and your kindness, Adnan is on the path to recovery.Your donations meant everything to Adnan. They weren’t just funds; they were a lifeline. You gifted him a new start and gave his family hope during their darkest moments. One day, the joy in Adnan's smile will reflect the impact of your support.Yet, hundreds more newborns in northern Syria need the same chance at life. Your next gift could be that hope for another child. Please, help us continue this lifesaving work—every donation counts.Thank you once again for your generosity and compassion.Links:","teaser":"Dear Supporter,Just moments after birth, Baby Adnan was fighting for his life Born late, his arrival put both him and his mother at extreme risk Swiftly, treatment began, stabilizing his breathing and battling the infectionYour donations meant everything to AdnanLinks:","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"post@david-dicke.de","title":" Your Donations Are Saving Newborn Lives! ","body":"Dear Supporter,We want to extend our deepest gratitude to you for your past support, which has already made a significant difference in the lives of many newborns in northern Syria. Thanks to your generosity, we have been able to save dozens of babies who were critically ill and in need of urgent care in our hospitals.Today, we want to share with you the story of Mohammad, a baby facing life-threatening challenges. Born with a severe chest deformity, Mohammad's tiny body relies on artificial ventilation, and his life is at risk without continued medical intervention. Every day, his situation remains fragile, and we urgently need your support to provide the life-saving care he requires.Your ongoing contributions are vital, not only for Mohammad but for many other newborns who depend on us for survival. With your help, we can continue to provide the intensive care they need to overcome these critical moments and give them a fighting chance at life.Please join us in ensuring Mohammad, and other vulnerable babies, get the chance they deserve. Together, we can continue to save lives in northern Syria.Thank you once again for your generosity and compassion.Links:","teaser":"Dear Supporter,We want to extend our deepest gratitude to you for your past support, which has already made a significant difference in the lives of many newborns in northern SyriaToday, we want to share with you the story of Mohammad, a baby facing life-threatening challengesLinks:","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"pguelfi@gmail.com","title":" With Your Support... We Light Paths of Hope for Families in Northern Syria ","body":"Dear Donor,Today, we would like to share with you the story of a young girl named Khawla, who lives with her father, mother, and seven siblings in a single tent in an informal camp in the countryside of Azaz, northern Syria. Like other children, Khawla dreams of a normal life, but the harsh living conditions shape a very different reality. Her father, who suffers from a neck disc condition, is unable to work and support his family, which adds to the challenges they face.Thanks to your generous donations, we have been able to provide bread for Khawla's family—a basic need that eases the daily hardships they endure. Every loaf they receive means so much; it is a symbol of kindness and hope for a dignified life amid difficult circumstances. Your ongoing support for these initiatives is of great importance. As needs grow, so does the significance of your role in providing essentials like food and bread to hundreds of families in the camps. Your continued contributions ensure that these families can live with dignity and hope for a better tomorrow.We extend our deepest gratitude for your support to those in great need. Your giving reflects the spirit of humanity, instilling in us the confidence that, through your help, we can make a real difference in the lives of many.With sincere appreciation and gratitude,Links:","teaser":"Dear Donor,Today, we would like to share with you the story of a young girl named Khawla, who lives with her father, mother, and seven siblings in a single tent in an informal camp in the countryside of Azaz, northern Syria Your ongoing support for these initiatives is of great importance","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" With Your Support... Extending a Helping Hand to Yusra's Family in Northern Syria ","body":"Dear supporter,In the countryside of Azaz, northern Syria, Yusra lives with her eight siblings in a modest tent within an informal camp, where the family lacks the essentials of life that many take for granted. After losing their father, the mother alone faces countless challenges to secure a living under harsh conditions.Living Conditions of Yusra’s FamilyYusra’s family lives in a simple tent lacking even the most basic needs. The family relies on any support that reaches them, given the absence of work opportunities and a breadwinner. The children face daily hardships beyond their years, adapting to life in an environment that offers them neither security nor comfort.Health Challenges of a SiblingIn addition to the difficult living conditions, the family faces another challenge: one of Yusra’s younger brothers suffers from a neurological condition that causes him severe pain episodes from time to time. This illness requires ongoing treatment that the family struggles to provide, increasing their suffering and basic needs.Impact of Your Support on the FamilyThanks to your generous donations, we were able to provide bread for Yusra’s family, helping to meet one of their essential needs and easing the burden of daily food provision. Your support goes beyond mere material assistance; it plants hope and extends a helping hand that enables them to face life’s challenges with dignity.The Importance of Continued SupportAlthough daily bread provision has been secured, the family remains in urgent need of continuous support, especially to ensure the brother’s treatment and meet other basic needs. Your continued support assures this family of a life with dignity and gives them hope for a better future.Thank you for your kindness and humanity, which reach those who need it most.Links:","teaser":"Dear supporter,In the countryside of Azaz, northern Syria, Yusra lives with her eight siblings in a modest tent within an informal camp, where the family lacks the essentials of life that many take for grantedThank you for your kindness and humanity, which reach those who need it mostLinks:","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Thanks to Your Support, Mohammad and His Family Find Hope for a Better Tomorrow ","body":"Dear Generous Donor,At Al Amal Al Umma Organization, we are deeply grateful for the presence of incredible heroes like you, who make the lives of those in need better through your generous support. Today, we would like to share one of our successes that has been made possible thanks to your continuous support.We would like to tell you the story of Mohammad, a 6-year-old child. Mohammad lives with his mother and his sister, Fathiyeh, in a worn-out tent in an informal camp in the city of Kafra, northern Syria. Mohammad lost his father two years ago during an attempt to migrate to Europe, where the boat he was on sank off the coast of Greece, taking Mohammad's and his sister's laughter with it. This tragedy marked the beginning of Mohammad's mother’s struggle to find a better life for her children amidst difficult circumstances that grow more complicated by the day.Thanks to your generous donations, we were able to provide bread for Mohammad's family, which helped alleviate some of their daily suffering. This assistance has been a source of hope for Mohammad’s family amid the harsh conditions they are enduring. Your support has also helped provide other essential needs, giving them a chance to live with dignity despite their ongoing struggles.Your continued generous support plays a vital role in changing the lives of many children like Mohammad and their families. Every donation you make represents a new hope and an opportunity to improve their conditions and ease their pain. We know that the challenges these children face are endless, but thanks to you, they now have hope for a better tomorrow.At Al Amal Al Ummah Organization, we believe that each of your donations carries a human touch that adds a glimmer of hope. Your continued support enables us to provide even more assistance to those in need.We sincerely thank you for your ongoing support and the trust you place in us. Thanks to you, we are able to bring smiles to the faces of orphaned children and their families and give them a chance for a better future.With sincere thanks and appreciation,Al Amal Al Umma OrganizationLinks:","teaser":"Dear Generous Donor,At Al Amal Al Umma Organization, we are deeply grateful for the presence of incredible heroes like you, who make the lives of those in need better through your generous supportWe would like to tell you the story of Mohammad, a 6-year-old child","charity_project":"Save the Children"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Prosthetic Support for Yasser, a Father of Three ","body":"Dear Supporter,Yasser, a father of three, who tragically lost his right leg due to the earthquake, has recently been fitted with a new lower-limb prosthetic at our NSPPL center. This essential device is a significant step towards restoring his mobility and enabling him to continue supporting his family.The provision of Yasser's prosthetic limb is part of our ongoing commitment to help individuals regain their independence after life-altering injuries. With this new prosthetic, Yasser is now able to move more freely, which is crucial for his role as a provider and caretaker.Thanks to your support, Yasser and many others are finding new hope and the means to adapt to their new circumstances. We are grateful for your generosity which continues to transform lives and assist those most in need.Thank you for your continued partnership in this vital work.With gratitude,","teaser":"Dear Supporter,Yasser, a father of three, who tragically lost his right leg due to the earthquake, has recently been fitted with a new lower-limb prosthetic at our NSPPL center With this new prosthetic, Yasser is now able to move more freely, which is crucial for his role as a provider and caretaker","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"post@david-dicke.de","title":" A Better Future for Sami: Corrective Support for Spinal Deformity ","body":"Dear Supporter,Sami, a four-year-old from a displaced Syrian family, suffers from a congenital spinal deformity. Recently, he visited our NSPPL center in Afrin, where our specialists assessed his condition. We have crafted a custom scoliosis brace designed to minimize his deformity and correct the alignment of his spine.This intervention is crucial for Sami as it not only improves his posture but also enhances his overall mobility and quality of life. Through the Steps to Recovery: Supporting Syrian Amputees project, we are committed to providing essential orthotic support to children like Sami, helping them lead healthier and more active lives.Thanks to your support, Sami is now on a path to better spinal health, and his family can look forward to his continued growth and improvement.Thank you for your generosity and commitment to helping young lives like Sami's recover and thrive.With gratitude,","teaser":"Dear Supporter,Sami, a four-year-old from a displaced Syrian family, suffers from a congenital spinal deformity Recently, he visited our NSPPL center in Afrin, where our specialists assessed his conditionWith gratitude,","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Steps to Recovery: Helping Taha Rebuild After the Earthquake ","body":"Dear Supporter,Taha, a Syrian refugee who lost his leg due to injuries from the recent earthquake, has received a custom-fitted and calibrated prosthetic limb. This prosthetic will help Taha regain mobility, allowing him to rebuild his life with greater independence and stability.This support was made possible by the generosity of our donors. Through the Steps to Recovery: Supporting Syrian Amputees project, individuals like Taha are given the chance to reclaim their independence and move forward with hope. Your kindness has a direct and lasting impact, providing essential care to those who need it most.As we continue our mission, your ongoing generosity will enable us to reach even more individuals in need, helping them regain strength and dignity. Thank you for being a part of this journey to make a difference.With gratitude,","teaser":"Dear Supporter,Taha, a Syrian refugee who lost his leg due to injuries from the recent earthquake, has received a custom-fitted and calibrated prosthetic limb This prosthetic will help Taha regain mobility, allowing him to rebuild his life with greater independence and stabilityWith gratitude,","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Your Support Makes a Difference in Mohammed's Life! ","body":"Dear Donor, Today, we would like to share the story of Mohammed, a ten-year-old orphan whose life has been deeply impacted by your generosity. Mohammed lost his father at a young age, leaving him and his family to face the hardships of life in a camp on the outskirts of Jarabulus in northern Syria. Despite his youth, Mohammed bears the weight of difficult circumstances, witnessing the daily struggles his family endures to secure basic necessities.Thanks to your continued support, we have been able to step in and help Mohammed’s family. Your contributions have allowed us to ease some of their burdens, providing them with essential needs and a sense of security amid uncertainty. Your kindness has given Mohammed not only material assistance but also hope, reminding him that he is not alone.The impact of your support extends beyond meeting immediate needs; it touches the hearts of children like Mohammed and brings stability to families who have lost so much. By continuing to support Mohammed, you are lighting the way for him toward a more hopeful future.Thank you for standing with us and for the invaluable role you play in transforming lives.Links:","teaser":"Dear Donor, Today, we would like to share the story of Mohammed, a ten-year-old orphan whose life has been deeply impacted by your generosity Mohammed lost his father at a young age, leaving him and his family to face the hardships of life in a camp on the outskirts of Jarabulus in northern Syria","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"post@david-dicke.de","title":" Together for Ibrahim: Bringing Hope to Orphaned Lives! ","body":"Dear Donor, We would like to share with you a touching story of one of the orphaned children supported by our Orphan Sponsorship Program, to highlight the impact of your contributions on their lives.Ibrahim, a nine-year-old boy, lost his father when he was just a year old due to a landmine explosion while his father was on his way to work in the agricultural fields near Hreitan city in northern Syria. Since then, Ibrahim, along with his mother and his 13-year-old sister, Sarah, have been living in difficult conditions in a camp on the outskirts of Jarabulus in northern Syria, facing daily challenges and a lack of basic life necessities.Thanks to your generous support, we have been able to sponsor Ibrahim's family, helping them secure essential needs and easing their daily burdens. Your contributions have brought hope into their lives, allowing them to feel a sense of safety and stability once again.Your continued support is essential to our mission to provide care for orphaned children and to give them a chance to live with dignity and to pursue their dreams. We invite you to continue this invaluable support that profoundly impacts their lives, giving them hope for a better future. Thank you for trusting us and for your invaluable generosityLinks:","teaser":"Dear Donor, We would like to share with you a touching story of one of the orphaned children supported by our Orphan Sponsorship Program, to highlight the impact of your contributions on their lives Thank you for trusting us and for your invaluable generosityLinks:","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Hope for Jana: Your Support Transforms Lives After Tragedy! ","body":"Dear Valued Donor, Thank you for your unwavering kindness and for being a lifeline to children like Jana. Her story is one of resilience in the face of unimaginable loss. When Jana lost her father and sister in the recent earthquake and their home was reduced to rubble, she and her mother found themselves in a world turned upside down, forced to move in with her grandfather and face life’s hardships with no source of support.Life since that tragic day has been a daily challenge. With no income, Jana’s mother struggles to provide even the basics. But thanks to your generous sponsorship, Jana is now able to access essentials like food and clothing, easing her mother’s burdens and restoring a sense of stability.Your support means more than just meeting physical needs. For Jana, it provides emotional comfort, a sense of security, and the chance to reclaim some of the innocent joy every child deserves. Your donations allow her to begin building a new life filled with hope and dreams, despite the shadows of her past.We are deeply grateful for your ongoing support for Jana and other vulnerable children facing the toughest of times. Your contributions bring light to their darkest days and plant seeds of hope for a brighter future. With heartfelt thanks and appreciation,Links:","teaser":"Dear Valued Donor, Thank you for your unwavering kindness and for being a lifeline to children like Jana Her story is one of resilience in the face of unimaginable lossLife since that tragic day has been a daily challenge With no income, Jana’s mother struggles to provide even the basics","charity_project":"Save the Children"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Celebrating Success: Alimatu and Hassanatu Complete Microsoft Office Training ","body":"Thanks to your support, Alimatu and Hassanatu were among ten young women who recently received certificates for completing Microsoft Office training at the Develop Africa Sierra Leone Computer Lab.In Sierra Leone, computer training is a game-changer for young women, providing them with the vital skills needed for today’s job market. Proficiency in Microsoft Office opens up new employment opportunities, supports their academic goals, and fosters self-sufficiency and confidence.Your ongoing support is transforming girls and young women into educated, empowered women. Monthly donations are especially impactful, helping girls pursue their education steadily. Every contribution, large or small, makes a difference! If you aren’t already a recurring donor, we invite you to consider joining us.You can also support us by sharing this project with your network and inviting others to join this meaningful initiative. For any questions, feel free to reach out at GlobalGiving@developafrica.org. Warmest regards,Amy and the Develop Africa Team PS. Does your employer match donations? Here’s an easy way to find out. Go to https://www.globalgiving.org/matching/Links:","teaser":"Thanks to your support, Alimatu and Hassanatu were among ten young women who recently received certificates for completing Microsoft Office training at the Develop Africa Sierra Leone Computer LabYour ongoing support is transforming girls and young women into educated, empowered womenorgglobalgiving","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"post@david-dicke.de","title":" Your Impact: Salma Advances in Her Mass Communications Diploma ","body":"We’re thrilled to share Salma’s inspiring update as she begins her second year of the Mass Communications diploma at Fourah Bay College.Salma wrote to us saying: “I’ve gotten to see my published grades on the student portal, and I was promoted with good grades from Mass Communications Diploma One to Diploma Two. I’m so excited to see that my hard work has paid off, and I’m so grateful for that.”Thanks to your support, young women like Salma in Sierra Leone are able to pursue their education and unlock new opportunities. By making a monthly donation, you help us provide lasting change for more girls. Every gift—no matter the size—brings us closer to a brighter future.For any questions, please reach out to us at GlobalGiving@developafrica.org.With heartfelt gratitude, Amy and the Develop Africa TeamP.S. **Save the Date: GivingTuesday, December 3rd!** It’s the perfect time to make an impact, with bonus funding available from GlobalGiving. Let’s #MoveAMillion together!Links:","teaser":"We’re thrilled to share Salma’s inspiring update as she begins her second year of the Mass Communications diploma at Fourah Bay College I’m so excited to see that my hard work has paid off, and I’m so grateful for that By making a monthly donation, you help us provide lasting change for more girlsS","charity_project":"Save the Children"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Empowering Potential: A Journey of Growth and Opportunity for Abigail ","body":"Below are the results of Abigail’s first year of Senior Secondary School (SSS1), where she excelled academically, particularly in business-related subjects. Her resilience, curiosity, and dedication have shone through, and while she has some areas needing extra support, her progress is inspiring.Abigail’s Academic HighlightsTop Subjects:- Business Accounting: Strong scores, consistently between 92-96.- Principles of Accounting: Impressive scores from 91 to 99.- Business Management Studies: High marks, scoring 94-96 across terms.Opportunities for Growth:- Health Science: Scores between 58-71, reflecting a need for additional support.- Principles of Economics: Fluctuating scores from 71 to 80.- English for Business: Scores ranging from 54-61, highlighting the potential for improvement.Overall Performance:- Term 1: 78.8%- Term 2: 85.8%- Term 3: 81.2%- Class Rank: Steady placement, finishing each term between 3rd and 6th.Abigail maintained perfect attendance and received encouraging remarks from her teachers, praising her “Very good performance, keep it up.” Investing in the education of girls in Sierra Leone leads to healthier, more prosperous societies.  Every contribution, whether through monthly donations or one-time gifts, makes a meaningful difference in the lives of girls like Abigail.  With sincere gratitude, Amy and the Develop Africa TeamGlobalGiving@developafrica.org PS.  Does your employer match donations?  Here’s an easy way to find out. Go to https://www.globalgiving.org/matching/Links:","teaser":"Below are the results of Abigail’s first year of Senior Secondary School (SSS1), where she excelled academically, particularly in business-related subjects Her resilience, curiosity, and dedication have shone through, and while she has some areas needing extra support, her progress is inspiring","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Empowering women through English language skills ","body":"Empowering Women through English Language SkillsProgram Overview: Prime Educational and Social Trust is dedicated to empowering women with the skills they need to thrive in their communities. Our English Language Program offers women from our vocational training center the opportunity to learn and enhance their English language skills. This program is designed to increase their confidence, employability, and independence, empowering them to build better futures for themselves and their families.Program Objectives: Enhance Communication Skills: Equip participants with essential language skills that enable them to engage confidently in professional and personal settings.Increase Employability: Provide women with the English proficiency needed to pursue better job opportunities, improving their economic independence.Boost confidence and self-esteem: Build participants’ confidence to express themselves and participate actively in the workforce and community life.Facilitate Access to Information: Enable access to educational resources, online platforms, and networking opportunities by breaking language barriers.Program Components:Interactive English Classes: Classes are designed to be interactive, focusing on reading, writing, speaking, and listening skills in practical, real-life scenarios.Professional and Conversational English: Courses cover basic to intermediate English, including vocabulary and phrases for job interviews, workplace communication, and day-to-day conversations.Small Group Learning: Small group classes ensure individual attention, allowing participants to learn at their own pace in a supportive environment.Digital Literacy Integration: Integrating basic digital skills with English training to further support participants' growth in today’s digital world.Program Outcomes: Upon completing the English Language Program, participants will:Gain confidence in communicating effectively in English.Be better prepared for employment in sectors where English language skills are a key asset.Have the skills to continue their English language journey independently or through advanced courses.Program Duration: The program spans three months, with two-hour classes held twice a week.","teaser":"Empowering Women through English Language SkillsProgram Overview: Prime Educational and Social Trust is dedicated to empowering women with the skills they need to thrive in their communitiesBe better prepared for employment in sectors where English language skills are a key asset","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Boat Tour for the children of Janani Home ","body":"Boat Tour for the children of Janani HomeThis week, we planned a special outing for the girls from Janani Home – a surprise boat tour through the beautiful mangrove forests! The moment we revealed the destination, excitement filled the air, and the girls couldn’t contain their curiosity and joy. For many, it was their first time on a boat, and their wide-eyed wonder as we cruised through the serene waters and lush green scenery was truly heartwarming to witness.Throughout the tour, the girls eagerly pointed out different plants and birds, and we all shared stories about the importance of protecting such unique natural habitats. The entire experience sparked a sense of adventure and connection to nature in each of them, fostering a deeper appreciation for the environment.By the end of the day, their faces were lit up with smiles, laughter, and memories they’ll cherish. This outing became a shared moment of joy and discovery, reminding us all of the simple yet profound happiness that nature can bring.We look forward to more such experiences that enrich their lives and bring them closer to the world around them.","teaser":"Boat Tour for the children of Janani HomeThis week, we planned a special outing for the girls from Janani Home – a surprise boat tour through the beautiful mangrove forests! The moment we revealed the destination, excitement filled the air, and the girls couldn’t contain their curiosity and joy","charity_project":"Save the Children"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Chess Training for the Children at Janani Home ","body":"Chess Training for the Children at Janani Home for GirlsAt Janani Home, our commitment to nurturing young minds goes beyond providing shelter and education. We are excited to share that our children have recently begun learning chess, a game that sharpens mental agility, promotes strategic thinking, and boosts confidence—skills that are essential in life beyond the board.The Benefits of Chess for Our ChildrenChess is more than a game; it is a tool for personal development. Through chess, the children are learning patience, focus, and the art of planning ahead. Each move challenges them to think critically and foresee potential outcomes, strengthening their decision-making skills. These lessons translate well into their academic work and everyday lives, enhancing their ability to approach challenges with confidence and creativity.Weekly Sessions with Experienced CoachesUnder the guidance of skilled chess coaches, weekly training sessions are held where children of all skill levels are encouraged to participate. For some, it’s their first time engaging in a structured strategy game, and they’re discovering new talents and interests they didn’t know they had! Coaches use a child-friendly approach, making the sessions engaging and fun while steadily building foundational skills.Positive Impact and Personal GrowthThe transformation in the children’s confidence is inspiring to see. They have shown remarkable enthusiasm, actively discussing strategies with one another and even setting up friendly competitions. Many of them have begun to look forward to the sessions as a highlight of their week, which also contributes to a stronger sense of community among them.Looking Forward: Expanding the ProgramWith the positive impact we’re witnessing, we aim to expand this initiative by introducing more advanced training and hosting small tournaments. This will further engage the children and provide them with an opportunity to compete, celebrate their progress, and learn the importance of both winning and learning from losses.Thank You for Your SupportThis initiative is possible thanks to the generous support from donors like you, who believe in the holistic development of the children at Janani Home. Every donation brings us closer to providing these young minds with experiences that equip them for a brighter future.Thank you for being part of this journey!","teaser":"Chess Training for the Children at Janani Home for GirlsAt Janani Home, our commitment to nurturing young minds goes beyond providing shelter and educationThe Benefits of Chess for Our ChildrenChess is more than a game; it is a tool for personal developmentThank you for being part of this journey!","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"post@david-dicke.de","title":" Nkululeko, our Social Worker and SHG Co-ordinator ","body":"My name is Nkulu, I started scouts in 2003, as one of the children who were on the pilot phase and immediately loved it. I was a scout for 6 years and I have made so many friends. My most precious experience was when I went to Johannesburg for PLTU Course (Patrol Leader Training Unit), we were trained on leadership skills, how to instruct and first aid. Through the training I discovered my career path, I knew right away that I wanted to work with children. After getting my Social Work degree I started working for Keep The Dream 196, I have been enjoying it because one of my deepest passions is working with children. Through KTD196 I have been given the opportunity to change and amend the National Scouts Programme for children throughout South Africa to make it achievable for children in rural and developing communities.One of my special moments as a Social Worker was when my colleague and I were helping out at one of the school groups under Keep The Dream 196. I was in charge of the scout group (age 11-15) and it was doing well, the children were coming to the meeting and actively participating. During one of our troop meetings, a school teacher came with a young boy, looking very angry and she didn’t know what to do with the boy.When she came to me her immediate words were “please help us with this little thief, I am tired, the school is tired and you are our last resort”. After she said that she didn’t even wait for me to respond, she let go of the child and left. Most of the children in the group started rejecting the boy as well because he was a thief and they didn’t want any of their stuff to go missing. After the 1st meeting, I asked some of the leaders in the group why they didn’t want him in the troop. They explained that the boy was a thief, he steals pens just to throw them away, he lies and he sometimes doesn’t sleep at home.I was very worried that the boy sometimes didn’t sleep at home, I had to get more information on him. I decided to go back to the teacher who brought him and asked her to tell me a bit more about the boy she brought to the troop meeting. The teacher explained that the child was basically staying all alone, his mom had a drinking problem and his grandmother sold alcohol as well. The boy practically takes care of himself, he sometimes steals money from his mom not to use it but just to stress his mother. She never attends any parent meetings or cares about how her child is doing academically. The teacher also explained that his grades have been dropping for a while and his mother doesn’t care at all.The following week the boy tried running away from the troop but I called him and asked him to come and he did, I told the other children that we are not perfect and should support each other. The little boy smiled and he asked if he can part of a patrol. He continued coming, he was very active within the troop and I saw how children were starting to accept him and had stopped calling him a thief. The boy started living a positive life, children who were staying next to him explained that he was always home and had started playing soccer. He was no longer stealing from his mother and would sleep at home. Through Keep The Dream 196 I have gained a lot of experience in community development, project management, training in Gender-Based Violence, and my self-confidence has improved as well.I have also had the privilege of representing KTD196 at the International level in Thailand and Kenya working on Child Protection Policies because of my Social Work Degree. I am now also working with the World Scout Movement on the Safe Scouting Policy. KTD196 has opened up so many doors for me to grow and develop but also to influence and bring hope and change to others. The children see me and they see that they too can reach their dreams!Another privilege I have had through KTD196 is the opportunity to travel across different provinces and also throughout Limpopo, learning about different challenges and different cultures, norms and values. I realised there is no one size fits all approach, that is why I love what I do, I am constantly learning and growing.Interview with NkuluNkululeko ‘Nkulu’ was the first Rover in the Limpopo Scout Region to obtain the BP Award, which is the highest Award in South African Rovering. I spoke to her about the role KTD196 and Scouting have had in her life and how she feels about making Rover history in Limpopo. ‘I come from a small village called Shiluvane in Limpopo.I joined the Scout Movement way back in 2003 as a Cub when my mother Elizabeth Mabuza introduced to it”, explains Nkulu. “My mother was – and still is – part of the Scouts’ family through the partnership with local NGO ‘Keep The Dream 196’. Even though I was a child, I could see how the programme was impacting my life and so I started being fully involved in 2004. My character was developing gracefully and I realised that I was behaving differently than many other children in my community.It was clear that I was learning a lot of things like leadership skills, self-leadership, communication skills, project management skills, perseverance, and of course pioneering – where I learned more about ropes and knots”, she says with a smile. When Nkulu turned 18yrs she stepped into adult uniform, joined the ‘KDT196’ team and started her own Cub Pack for children aged 7-11yrs, plus spearheaded the growth of Cubbing throughout the Limpopo Scout Region once she graduated from university. However, every journey has its challenges and Nkulu has encountered – and overcome – some along the way. “One of my biggest challenges was time management,” continues Nkulu. “At some point, I had to juggle academics as a university student and Scouting. I’m also a bit of an overachiever and so I tried to perfect everything that I did, even things that were beyond my control.So that was challenging at times. But I was able to overcome these challenges by looking at the bigger picture and what I wanted to achieve. I learnt that I can do anything I put my mind to.” Nkulu remained focused on completing the activities required in order for her to achieve her BP Award.“I was elated when I was handed my BP Award,” she says excitedly. “I felt honoured and appreciated that my hard work and dedication had finally paid off. It also boosted my profile and leadership skills. Rovering is all about service and I am so much passionate about community development and about helping children in rural communities to achieve their dreams with the little resources that they have. Some of the activities that I ran within my community included the colour run, career exhibitions, and a recycling project which was done at one of our schools” she adds.Nkululeko is currently also the Chair of the National Cub programme in South Africa. “In addition to achieving my BP Award as a Rover, I also plan on continuing to work together with my Cub team to achieve all our goals and fulfil all my duties. Moreover, by completing the Personal Bar and Movement Bar within the Rover Programme I have learnt that values acquired in Scouting stay with you and motivate you to do more in life. “All of this was made possible through Louise and my mother Elizabeth and their vision to help orphan and vulnerable children in Limpopo by starting Keep The Dream196, and you as a sponsor! In South Africa, we have a saying “It takes a village to raise a child!” I hope you are happy with your investment in my life.I am like so many others coming up behind me, I just have the privilege of being the first in our province to be awarded this award, but watch this space, more are coming through thanks to you!” Thank you so much and God Bless you NkuluLinks:","teaser":"My name is Nkulu, I started scouts in 2003, as one of the children who were on the pilot phase and immediately loved it I was a scout for 6 years and I have made so many friends Through the training I discovered my career path, I knew right away that I wanted to work with children","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Water as a Human Right! ","body":"Avuxeni, minjane? Umfikile, minjane! (Hello, how are you? I am well!)Greetings from cloudy, overcast, cool Tzaneen! It is November and we should have seen the start of the tropical rains but as yet, we have not really seen anything more than light sprinkles instead of the torrential rains. The dams are getting lower, the municipalities in the local areas are unable to provide water to the towns on a regular basis, with most towns in the area actually having their water switched off from 0900 till later in the evenings if it returns.That applies to a large number of the cities in this country, as infrastructure decays due to lack of maintenance over the last 20+years. Water restrictions have become common place, in the small town where I live, water on a daily basis is unavailable except for a few hours, the villages have a worse problem as reliance upon water tankers provided by municipality or entrepreneurs capitalising on the corrode infrastructure profit from a commodity guaranteed under Human Rights.Water and sanitation are Sustainable Development Goals identified by the South African Government to action urgently.Imagine, you have a family of 5, 2 adults and 3 children. You will probably have a drop toilet, which means you won’t need water for flushing however with 3 children, you will need to do hand washing daily. School uniforms on a daily basis, plus play clothes as most children may only have one uniform or perhaps two if very fortunate. Imagine trying to wash blankets, sheets, bed linen, by hand and you have minimal water access. What if you have a sick member of the family who has fever and sweats repeatedly overnight, you may need to do bed linen on a daily basis.Cooking, cleaning floors, washing dishes etc., plus drinking! The average water consumption per day is 230-800Litres per household. Now consider, you have to walk 4kms every day with 5 x 20Litre water containers to go and collect water from the closest tap in the village which is turned on daily or even twice a week plus take your turn in the que to receive this precious commodity.Although South Africa is viewed as a first world nation, it has third world conditions. Many school children spend their precious study time waiting in ques for water, as do mothers to whom this chore invariably falls to.Through your support, our SHG groups are consistently demanding the infrastructure to be fixed. At least now in three communities, boreholes have been repaired and water restored. You are making such a huge difference to the day to day lives of the people we serve. Thank you for believing in the work we do!God bless youLouiseLinks:","teaser":"Avuxeni, minjane? Umfikile, minjane! (Hello, how are you? I am well!)Greetings from cloudy, overcast, cool Tzaneen! It is November and we should have seen the start of the tropical rains but as yet, we have not really seen anything more than light sprinkles instead of the torrential rains","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"post@david-dicke.de","title":" More from Camporee 2024!! ","body":"Avuxeni! Minjane? Umfekile, minjane! (hello, how are you? I am fine!)Thank you so much for partnering with us. I really appreciate the involvement you have with KTD196 and our beneficiaries, together we are changing lives for the better, we a giving a hope and a future to kids that may not have otherwise had one. The children are becoming “intentional” about their futures and not just going with the flow, which is wonderful.I realised that with the passing of Mum Rose I omitted to share all the fun of camp for September 2024. We had lots of fun with the Cubs and Scouts. It is always wonderful to see the young leaders stepping up and training younger children in the skills they have mastered.We had a camporee which is a fancy name for a Scout competition, we had 5groups participating and all had to create a campsite displaying their abilities with construction and pioneering. They had to personalise their campsites and basically show off what they had learnt.We also had competitions regarding first aid, CPR (Cardio-Pulmonary Resuscitation), knotting, map skills, hiking, emergency management. A wide variety of skills that we expect the children to learn.I have included some video’s below in the link section for you to get a feel of the camp. I hope you enjoy.BlessingsLouiseLinks:","teaser":"Avuxeni! Minjane? Umfekile, minjane! (hello, how are you? I am fine!)Thank you so much for partnering with us The children are becoming “intentional” about their futures and not just going with the flow, which is wonderful We had lots of fun with the Cubs and Scouts I hope you enjoy","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" lizette Business journey ","body":"Lizette, a returnee in Tole, initially engaged in the sale of used clothing, referred to locally as \"Okrika,\" with a starting capital of 15000 FRS ( about $ 24.27). She expressed a desire to expand her business; however, her primary obstacle was the lack of financial resources and support. To procure inventory, she frequently traveled from Tole to the Muea market. Upon being identified by a social worker from Reach Out, Lizette developed a comprehensive business plan aimed at expansion.Recognizing her entrepreneurial spirit, Reach Out provided her with business management training. With a capital investment of 80,000 FRS ($131.67) from Reach Out, Lizette successfully expanded her business, enabling her to purchase clothing bales at the cost of 150,000 FRS ($248.89).Initially, Lizette and her husband experienced stable economic conditions. However, the outbreak of the Anglophone crisis significantly impacted their lives. After two years, circumstances deteriorated further when her husband became a target of suspicion regarding affiliations with a non-state armed group, as perceived by the armed forces.In light of security concerns, the couple relocated to Mamu, a small village within the Fako division. During their time there, Lizette underwent a cesarean section and their primary source of income transitioned to vegetable farming. Tragically, Lizette's husband succumbed to poisoning, leaving her as the sole caretaker of their child.In 2020, upon learning that stability had returned to Tole, she returned to the area and utilized her savings to re-establish her small clothing business. Additionally, she rented parcels of land to cultivate vegetables, which have been essential for her sustenance since her return. Lizette's rationale for returning to Tole was the existence of a substantial market and the relatively lower cost of living. Before the crisis, she had capital amounting to 150,000 FRS ($248.89) and consistently generated an average monthly profit of 50,000 FRS (approximately $49.74). Currently, her operating capital stands at 30,000 FRS (around $49.74), and she earns a monthly profit of 10,000 FRS (approximately $16.59) through sales at the Tole market and direct sales from her home. Despite the challenges she has faced,Lizette remains optimistic that her circumstances will improve, allowing her to fulfill her aspirations of becoming a successful entrepreneur. She acknowledges that her current business viability is largely attributable to the training and support provided by Reach Out NGO, which instilled in her the significance of saving for unforeseen circumstances. This guidance has continually motivated her to persevere, reinforcing her belief that there is always hope, regardless of the situation.","teaser":"Lizette, a returnee in Tole, initially engaged in the sale of used clothing, referred to locally as \"Okrika,\" with a starting capital of 15000 FRS ( about $ 2427) She expressed a desire to expand her business; however, her primary obstacle was the lack of financial resources and support89)74)","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"post@david-dicke.de","title":" Electa's Business Growth ","body":"Electa is a 30-year-old returnee living in Tole and a single mother of two. She was one of ReachOut's beneficiaries in 2015. At that time, she sold cooked meat with an initial capital of 5,000 FRS (about $8.30), earning a monthly profit of 2,000 FRS (approximately $3.30). After being identified as a beneficiary, she received training in business management from ReachOut, along with a capital boost of 30,000 FRS (around $49.74). This financial support allowed her to expand her business by cooking meat in larger quantities and adding bread to her offerings, which increased her average monthly profit to 10,000 FRS (about $16.59).Throughout her journey, Electa received constant support from ReachOut, demonstrating seriousness and dedication to her business. Due to her commitment, she qualified for a second-level grant. However, while she was on her way to the market to buy clothes for a planned new business venture, she was unfortunately robbed, losing all the money she had. This setback forced her to return to her original meat business, and she had to rely on her savings to start over.In 2019, due to a severe crisis in Tole, Electa moved to Buea to live with her brothers. In Buea, she faced numerous challenges, including having to buy everything, even water for bathing, while living in a single room with ten other people. Although she continued her meat business, it struggled due to her being new to the area. After two years, her capital dwindled as she had to support her family.In 2022, Electa returned to Tole, having heard that conditions had improved. Life in Tole was more affordable than in Buea, so she resumed her business and introduced raw beef, which was not available locally. She also had a small fridge—purchased in 2016 with her profits—that enabled her to cook some of the meat and continue selling it.Today, Electa has significantly grown her business. She sells cow beef, cooked meat, and firewood to support herself and her two children, who are both now in school. Reflecting on her journey, she recalls the invaluable lessons learned from ReachOut, especially the advice from a social worker: “No matter the situation, always keep your capital safe so you can start over whenever you need to.”","teaser":"Electa is a 30-year-old returnee living in Tole and a single mother of two She was one of ReachOut's beneficiaries in 2015 At that time, she sold cooked meat with an initial capital of 5,000 FRS (about $830), earning a monthly profit of 2,000 FRS (approximately $330)74)59)”","charity_project":"Save the Children"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Creating a positive impact in Flora's life ","body":"Flora faced challenges in her early days as an entrepreneur due to limited capital and an inconsistent income. She sourced clothing from Douala and resold it in Mudeka and surrounding communities, but her earnings barely covered her family's needs. Initially, her business was small, and her dream of expansion seemed far away. However, everything changed when social workers from Reach Out Cameroon conducted a door-to-door identification process in Mudeka, recognizing Flora’s potential and selecting her for their support programs. As part of this initiative, Flora received financial assistance and essential training in business management, bookkeeping, entrepreneurship, and savings. This training helped her manage her finances better and set clear growth goals for her business. She soon received her first-level grant of 57,000 FRS (approximately $95.02), which she used to expand her inventory, diversify her clothing offerings, and attract more customers in her community. Flora’s dedication and strategic thinking paid off. She was able to increase her business income and reinvest it, gradually growing her capital. Recognizing her steady progress, Reach Out Cameroon offered her additional support in the form of a second-level grant of 114,400 FRS (around $189.38) after six months. This second round of funding allowed her to diversify even further, adding footwear to her product lineup, which made her business even more appealing to her expanding customer base.","teaser":"Flora faced challenges in her early days as an entrepreneur due to limited capital and an inconsistent income She sourced clothing from Douala and resold it in Mudeka and surrounding communities, but her earnings barely covered her family's needs Flora’s dedication and strategic thinking paid off","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"post@david-dicke.de","title":" Director: KIFA Verifying Organizational Progress ","body":"Director: KIFA verifying organizational progressIn an attempt to verify the organizational success of Kole Intellectual Forum; as it has always been the ways of verification of the organization for the last eight years of its operation that is, since 2016; the annual meeting of the organization have directed the Directors (non-siting ones, each one of them) to at least come and verify the successes of the organization and where necessary to advise the management of the areas that needed the correction.Their direction of verification are on these areas:","teaser":"Their direction of verification are on these areas:","charity_project":"Oxfam"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Promoting gender equality among youth ","body":"Promoting gender equality among youthAlthough, Kole Intellectual Forum at present is concentrating on a program that empowers a girl child for self-reliance (https://goto.gg/31562:) in Kole District, Northern Uganda; the organization on the other hand, to certain extent, in its program to be establishing a health facility in Kole District (https://goto.gg/62863) is not forgetting to design relevant program that may embrace empowering boys also to help them address the issue of gender equality; for instance, the organization is addressing the root causes of gender inequality and providing the young people with the necessary skills, knowledge, and opportunities, by cultivating a generation of empowered individuals who can contribute positively to their communities and break the cycle of gender-based discrimination.A three days’ workshop was organized by the organization to train both girls and boys within the area on how avoid to contract sexually transmitted diseases and in case of danger; they were also advised or informed of the available areas to access the treatment in the health facilities; particularly, in the nearby health facilities.  ","teaser":"Promoting gender equality among youthAlthough, Kole Intellectual Forum at present is concentrating on a program that empowers a girl child for self-reliance (https://goto  ","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Policies review for KIFA is in progress ","body":"Policies review for KIFA is in progressWith an attempt to develop a number of organizational policies; like, financial policy, human resource policy, code of conduct, child protection policy, risk management policy and others since 2018; Kole Intellectual Forum through their members of Board as well as staff and students have tasked the top management of the organization to have a moment to review these policies. And the reasons to review them were supported by the following reasons, that to the:","teaser":" And the reasons to review them were supported by the following reasons, that to the:","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Fostering Dreams in Rural India !! ","body":"Dear Esteemed Donor, Namaste!Warm Greetings from RSKS India Family!!Rajasthan Samgrah Kalyan Sansthan (RSKS India) launched the \"Education For Every Girl\" program to provide much-needed educational support to underprivileged girls from poor and needy families. In this initiative, the RSKS India organization successfully distributed educational materials to approximately 1050 girls across more than 45 different rural villages. The materials included essential items such as school bags, pens, pencils, notebooks, eraser, drawing books, registers, and rulers—basic tools that are crucial for a child’s educational journey.The distribution took place at various rural schools, where RSKS team members organized events to ensure a smooth and joyful experience for the girls. Each distribution event was filled with excitement as the girls received their educational materials. The RSKS team took the time to engage with the beneficiaries, explaining the importance of education and encouraging them to dream big and aspire for a brighter future. The smiles and joy on the faces of the girls upon receiving their educational supplies were a testament to the importance of this program. The distribution not only provided tangible materials but also inspired a sense of hope and motivation among the girls. By fulfilling their immediate educational needs, RSKS India has made a significant step toward ensuring that these girls can pursue their studies without the added burden of financial constraints.The impact of the \"Education For Every Girl\" program has been profound and transformative for the 1050 girls who received educational materials. For many of these girls, the distribution was a turning point that fulfilled a long-held dream of having the necessary tools to pursue their education. The school bags, stationery, and other supplies serve as symbols of hope and empowerment, indicating that their education is valued and supported by RSKS India and their community.With the educational materials, these girls are now better equipped to engage in their studies, which can significantly improve their academic performance and self-esteem. This support not only enhances their immediate learning experience but also instills a belief in their potential to succeed, thereby creating aspirations for higher education and better career opportunities in the future. Overall, the \"Education For Every Girl\" program has not only provided essential educational materials but has also created a spirit of hope, motivation, and empowerment among the beneficiaries, setting them on a path toward a brighter future.We welcome your comments and suggestions on this report and are grateful for your support in making such impactful experiences possible.Warm regards,Team RSKS IndiaFollow us on Facebook https://www.facebook.com/rsksindiaStay healthy and safe!Links:","teaser":"Dear Esteemed Donor, Namaste!Warm Greetings from RSKS India Family!!Rajasthan Samgrah Kalyan Sansthan (RSKS India) launched the \"Education For Every Girl\" program to provide much-needed educational support to underprivileged girls from poor and needy familiesfacebook","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"post@david-dicke.de","title":" Dreams Wrapped in Paper & Ink...... ","body":"Dear Esteemed Donor, Namaste!We’re proud to work with RSKS India, empowering marginalized communities with transparency and impact. Here’s one inspiring story of change we’re thrilled to share with you.A Story of KISHORE.........!!My name is Kishore (Name Changed), and I am 52 years old. I have been the teacher of our rural school for over a decade now, and during this time, I’ve seen the struggles that our students, especially the girls, face in their pursuit of education. Our school serves a small village community where most families rely on daily wage labor or small-scale farming to make a living. The challenges of poverty are ever-present, and they often manifest in the form of limited resources for education. One of the most heartbreaking aspects of my job has been watching bright, eager students come to school without the necessary materials to fully engage in their studies. I’ve seen young girls borrow pens and notebooks from their classmates or struggle to complete assignments because they simply didn’t have the tools they needed. Rajasthan Samgrah Kalyan Sansthan (RSKS India) reached out to our school with their \"Education For Every Girl\" program. When they explained the initiative to me, I was immediately struck by how much it could help our students, especially the girls who were most in need of support. The RSKS India team conducted a baseline survey to identify the students who would benefit most from the program. They selected 25 girls from our school who were facing significant challenges in accessing the educational materials they needed. These were girls who had the potential to excel in their studies but were being held back by circumstances beyond their control.The day of the program’s distribution event was one of the most uplifting days I’ve experienced as a teacher. The RSKS India team arrived with bags filled with school supplies—school bags, pens, pencils, notebooks, scales, drawing books, geometry boxes, and even color sets. It was everything our students needed to fully participate in their education. As the girls received their supplies, the joy on their faces was palpable. I could see how much this support meant to them and their families. For these students, the new school bags and materials were more than just tools; they were symbols of hope and a brighter future. I knew that these supplies would not only help them in their studies but also boost their confidence and motivation. On behalf of our entire school administration, I want to express my deepest gratitude to RSKS India. Their \"Education For Every Girl\" program has not only provided much-needed support to our students but has also brought hope and encouragement to our entire school community. Thanking you so much for your kind cooperation and financial support. it is very without your generous donation difficult for us !!At RSKS India, we value your feedback, comments, and suggestions on our programs. Please visit our website at www.rsksindia.ngo or contact us at admin@rsksindia.ngoMany thanks again for your support!!Team RSKS IndiaFollow us on https://www.facebook.com/rsksindia for the Regular Updates!Stay Healthy & Keep Smiling!!Names and locations have been changed to protect privacy.Links:","teaser":"Dear Esteemed Donor, Namaste!We’re proud to work with RSKS India, empowering marginalized communities with transparency and impact Here’s one inspiring story of change we’re thrilled to share with youA Story of KISHORE!!My name is Kishore (Name Changed), and I am 52 years oldrsksindiafacebookLinks:","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"pguelfi@gmail.com","title":" The Impact of Education: Guddi's Heartfelt Story. ","body":"Dear Esteemed Donor, Namaste!We’re proud to work with RSKS India, empowering marginalized communities with transparency and impact. Here’s one inspiring story of change we’re thrilled to share with you.A Story of GUDDI.........!!My name is Guddi (Name Chaned) and I am 14 years old. I live in a small village with my parents and my four siblings. Life in our village is simple but not easy, especially for families like mine. My parents work as daily wage laborers, toiling in the fields or doing whatever work they can find to make sure we have food to eat. But despite their hard work, it’s often difficult for them to provide everything we need, especially when it comes to our education. Being one of five children, I’ve learned to share almost everything with my brothers and sisters—clothes, shoes, even our small house. But when it came to school supplies, sharing wasn’t always possible. We needed our own books, pens, notebooks, and other materials to keep up with our studies. I remember many days when I had to borrow a pen from a classmate or use a torn notebook because we couldn’t afford new ones. It made school difficult and sometimes embarrassing. There were times when I thought about giving up on my studies. It was hard to focus on my lessons when I didn’t even have the basic materials to write with. My teachers were kind and understanding, but I knew they couldn’t always provide for us either. The thought of how hard my parents were working just to keep us in school made me determined to continue, but it was a struggle every day.Then one day, something happened that changed everything. Rajasthan Samgrah Kalyan Sansthan (RSKS India) came to our village with their \"Education For Every Girl\" program. When I first heard about it, I didn’t believe it was real. They were going to give us all the school supplies we needed for free? It sounded too good to be true. But when the day finally came, I realized that it was real, and it was exactly what we needed. The RSKS India team organized a small event at our school. They handed out school bags filled with everything a student could need—pens, pencils, notebooks, a geometry box, a scale, drawing books, and even a set of colors. When they called my name and handed me my bag, I couldn’t believe my eyes. It felt like a treasure chest. For the first time, I had everything I needed to study properly, just like the other kids in my class.But the program wasn’t just about giving us supplies. The RSKS India team also talked to us about the importance of education, especially for girls. They explained how education could change our lives, how it could give us opportunities that our parents never had. I listened carefully, and for the first time, I felt a sense of hope. I started to believe that maybe I could have a future that was different from the hard life my parents were living.With the new supplies, my attitude towards school changed. I was excited to go to class, eager to use my new notebooks and pens. My handwriting improved because I didn’t have to worry about running out of paper or ink. I could finally focus on learning, and my grades began to improve. My teachers noticed the change in me, and they encouraged me even more. My parents were also very happy. They were relieved that they didn’t have to worry about buying school supplies for all of us. Me and my parents thank RSKS India team from the bottom of our hearts. The support we received wasn’t just about the materials; it was about giving us the confidence to continue our education and the belief that our dreams mattered.Thanking you so much for your kind cooperation and financial support. it is very without your generous donation difficult for us !!At RSKS India, we value your feedback, comments, and suggestions on our programs. Please visit our website at www.rsksindia.ngo or contact us at admin@rsksindia.ngoMany thanks again for your support!!Team RSKS IndiaFollow us on https://www.facebook.com/rsksindia for the Regular Updates!Stay Healthy & Keep Smiling!!Names and locations have been changed to protect privacy.Links:","teaser":"Dear Esteemed Donor, Namaste!We’re proud to work with RSKS India, empowering marginalized communities with transparency and impact Here’s one inspiring story of change we’re thrilled to share with youA Story of GUDDI!!My name is Guddi (Name Chaned) and I am 14 years old It felt like a treasure chest","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"post@david-dicke.de","title":" Rahma's story completed with you. Did you know? ","body":"What comes to mind when you hear the name \"Rahma\"? This word, which signifies kindness and compassion, holds a profound meaning. Have you ever thought about its deep impact? Let us tell you her story…Rahma, a young girl of eighteen, has carried a dream with her since her father first gave her this name. She aspired to become a doctor, embodying her name’s essence, to be a true source of mercy for the weak and the needy. But fate was harsh; she lost her father and found herself surrounded by despair, far from school, in a place where dreams seemed out of reach. Then, you stepped in! And her story began anew.Through your support and generosity, Rahma returned to school, a smile brightening her face, and a spark of determination glowing in her eyes. She is rebuilding her dream, striving to become the doctor her father always wished to see. Her return to school has become a story of hope, not just for her, but for her siblings, her neighbors, and her entire community.Today, Rahma’s dream is no longer just her own; it’s a beacon of hope inspiring her siblings, friends, and community. Every time she sits down to study, she carries a message within her—that the world can be a more compassionate and humane place.Imagine the profound impact of your support now. Imagine how the word \"thank you\" from Rahma’s heart holds a thousand meanings... This gratitude is for you because you were not just a supporter; you were her mercy, the one who revived her dream.Links:","teaser":"What comes to mind when you hear the name \"Rahma\"? This word, which signifies kindness and compassion, holds a profound meaning She aspired to become a doctor, embodying her name’s essence, to be a true source of mercy for the weak and the needy Then, you stepped in! And her story began anewLinks:","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"pguelfi@gmail.com","title":" An Unforgettable Impact! ","body":"Imagine a generation raised on the values of giving, seeing every act of volunteer work as an opportunity to make the world a better place!This is our goal in the Student Activities Pathway: to build a generation imbued with values and responsibility.In an interactive session prepared by the Masar team, our students gathered in an encouraging environment to explore the meaning and impact of volunteer work. It was an inspiring experience that showed them how small actions can make a real difference. They discovered the benefits of volunteer work for individuals and the community and how a volunteer can be a source of inspiration and positivity.During this session, our students embraced core values that help them become role models in giving—values like commitment, honesty, and integrity. They learned the importance of equality and that respect is a right for everyone. They also understood that protecting others' privacy is a fundamental part of integrity and that true giving aims not at personal gain but at making a genuine difference.Our students left the session with a renewed spirit and a deeper understanding of what giving truly means, becoming more aware that real change starts from within. These values they’ve acquired are not just lessons but a message they carry forward to others.Perhaps you share this goal with us. Perhaps you’ve experienced these moments when you saw your efforts bear fruit in our students' lives. Together, we take great strides toward building a society rooted in human values—a society shaped by volunteers like you, carrying the message of goodness in their hearts.From the bottom of our hearts, thank you for your commitment and partnership.Links:","teaser":"Imagine a generation raised on the values of giving, seeing every act of volunteer work as an opportunity to make the world a better place!This is our goal in the Student Activities Pathway: to build a generation imbued with values and responsibilityPerhaps you share this goal with usLinks:","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"pguelfi@gmail.com","title":" How Did You Change Bara'a's Path? Discover Now! ","body":"What does childhood look like when it's filled with books instead of burdens? When children’s hearts are enriched with knowledge instead of worries? This is Bara’a's story, a story of hope made possible by your continuous support.Bara’a was a young boy shouldering responsibilities far beyond his age, working tirelessly to help his family. His childhood wasn’t one of play and carefreeness; he knew only labor and challenges. Despite his youth, he was a beacon of hope for his family, especially for his siblings and his mother.But what about Bara’a's dreams? His future? Thanks to your generous hearts, Bara’a received a gift of a lifetime: the opportunity for education—a chance to explore new horizons he never thought possible.Today, Bara’a’s smile lights his way. He’s passionate about learning, filled with ambition, and believes in a brighter future. He’s beginning to see his potential and striving to fulfill it.Imagine the hope children like Bara’a feel thanks to your support! There are hundreds of children who, every day, await a helping hand to lift them from life’s hardships and bring them into a world of childhood and learning. Their stories mirror Bara’a’s, and their dreams are waiting for that window of hope to open.Thank you for the profound impact you've made, for reviving the dreams of childhood, and for the hope that, thanks to you, will continue to brighten the lives of Bara’a and every child in need.Remember, the goodness you give today will live on in the lives of these orphans, making a lasting difference and building hope that endures. Links:","teaser":"What does childhood look like when it's filled with books instead of burdens? When children’s hearts are enriched with knowledge instead of worries? This is Bara’a's story, a story of hope made possible by your continuous supportToday, Bara’a’s smile lights his way Links:","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"post@david-dicke.de","title":" November's Project of the Month: Empowering Young Minds in Central Java ","body":"Dear Project of the Month Club Member,This November, we’re proud to spotlight an organization that is nurturing curiosity and values-based learning for children in Indonesia—an effort that extends far beyond the classroom and uplifts the entire community.In the rural village of central Java, social and economic pressures often force children to delay their education or drop out early, leaving them with limited job prospects as they grow up. The limited access to quality, affordable education stifles each child's unique potential and hinders the community's ability to thrive. Teachers also face challenges due to inadequate training and support, affecting their morale and ability to and restrict their ability to fully engage with students.Thankfully, our November Project of the Month, TCKN Foundation, is tackling this educational challenge by building a modern, fully-equipped school in the village. The project goes beyond providing scholarships and classroom resources—it also prioritizes attracting and training skilled teachers, which will help the Foundation reach more students and expand its impact.When the Foundation shared their plans for the new school building, they emphasized that these efforts will help them fill the school with necessary resources such as classroom equipment and library materials. “We were so thrilled and delighted to hear the news. This is an uplifting morale-booster and deeply appreciated financial support at a time of need.” Christopher Drake, Co-Founder of TCKN Foundation stated.To learn more about how TCKN Foundation is transforming education in Central Java, check out their most recent report.Thank you for your commitment to a better world!With gratitude, Victoria VranaGlobalGiving CEO","teaser":"Dear Project of the Month Club Member,This November, we’re proud to spotlight an organization that is nurturing curiosity and values-based learning for children in Indonesia—an effort that extends far beyond the classroom and uplifts the entire community","charity_project":"Oxfam"},{"report_type":"article","user":"pguelfi@gmail.com","title":" October Project Of The Month ","body":"Dear Project of the Month Club Member,This October we are shining a light on an organization standing with Indigenous communities in Chiapas, where indigenous people face constant threats to their autonomy, culture, and way of life due to corporate interests, militarization, and organized crime. However, this tragic assault on land, culture, and autonomy is not sliding without opposition. As Indigenous communities raise their voices for their land and territory, October Project of the Month winner Frayba works to document violent actions against the Indigenous communities, carry out training sessions to help identify risks and threats against their land; and remind the state of their responsibility to defend the lives of local people and create actions for public advocacy of Indigenous rights.When Fundraising Manager Nora González  learned that Frayba had been selected as the October POMC, she shared that these funds will create communication products that help raise awareness of the displacement problem in Chiapas.“We are grateful for this recognition, because it is the result of the efforts of many people,” Nora said. “We are confident that this will help us reach more people who want to donate and show their solidarity with the people of Chiapas.”We invite you to read more about Frayba's impactful work and ongoing challenges by checking out their most recent project report. Thank you for your commitment to a better world! With gratitude, Victoria VranaGlobalGiving CEO","teaser":"Dear Project of the Month Club Member,This October we are shining a light on an organization standing with Indigenous communities in Chiapas, where indigenous people face constant threats to their autonomy, culture, and way of life due to corporate interests, militarization, and organized crime","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" September Project of the Month ","body":"It’s the start of a new month—and we’re kicking off September by drawing attention to an urgent appeal from our partner Support Yemeni Society Organization for Development SYS. Their team recently reached out for support after heavy floods in Hodeida, Yemen, that are exacerbating the ongoing humanitarian crisis in the country.The floods have destroyed homes, farms, and infrastructure—displacing families and causing significant loss to life and property. The Support Yemeni Society’s recent project, “Urgent Appeal for Assistance to Flooding in Yemen” will provide emergency food, water, and medical aid to thousands of displaced families.In non-disaster times, the nonprofit works across sectors from biodiversity to education and food security to help Yemeni people, who are experiencing one of the world’s worst humanitarian crises. According to the UN estimates, the Yemen Civil War has left nearly 55% of the country’s population, or 18.2 million people, in need of assistance. The conflict has disrupted job markets dramatically, making it very difficult for people to earn a living for themselves and their families. Support Yemeni Society knows that to truly help Yemeni people, solutions need to be holistic. Their community support ranges from implementing water treatment systems to providing nutritious meals to thousands of students in rural Yemen. When Founder and CEO Ahmed Al-Qadhi learned that Support Yemeni Society had been selected as the September POMC, he shared that these funds will go a long way in providing critical aid to flood-affected communities. “The funds will allow us to provide aid to reach thousands of displaced families in the immediate aftermath of the floods. Additionally, it will enable us to repair damaged infrastructure like roads and bridges, restoring access to essential services and helping communities get back on their feet. Over the next year, these resources will be instrumental in supporting longer-term recovery efforts, including rebuilding homes, schools, and hospitals, as well as helping revive livelihoods that were devastated by the disaster. We are confident that this partnership with GlobalGiving will have a profound and lasting impact on the lives of those affected by the flooding in Yemen.”Thanks to your ongoing support of this fund, GlobalGiving was able to send a flexible, rapid grant to the Support Yemen Society so they can continue their necessary and compassionate work. If you’re interested in learning more about Support Yemeni Society Organization for Development SYS, you can check out their project page.Thank you for your commitment to a better world! With gratitude, Victoria VranaGlobalGiving CEO","teaser":"It’s the start of a new month—and we’re kicking off September by drawing attention to an urgent appeal from our partner Support Yemeni Society Organization for Development SYS According to the UN estimates, the Yemen Civil War has left nearly 55% of the country’s population, or 18","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"pguelfi@gmail.com","title":" You Gave Baby Adnan a Fighting Chance at Life! ","body":"Dear Supporter,Just moments after birth, Baby Adnan was fighting for his life. Born late, his arrival put both him and his mother at extreme risk. But thanks to your generosity and the immediate action of our dedicated doctors at Al-Ikhaa Hospital in northern Syria, Adnan was rushed to the intensive care unit, where they discovered a life-threatening blood infection and severe respiratory distress. Swiftly, treatment began, stabilizing his breathing and battling the infection. Today, by the grace of God and your kindness, Adnan is on the path to recovery.Your donations meant everything to Adnan. They weren’t just funds; they were a lifeline. You gifted him a new start and gave his family hope during their darkest moments. One day, the joy in Adnan's smile will reflect the impact of your support.Yet, hundreds more newborns in northern Syria need the same chance at life. Your next gift could be that hope for another child. Please, help us continue this lifesaving work—every donation counts.Thank you once again for your generosity and compassion.Links:","teaser":"Dear Supporter,Just moments after birth, Baby Adnan was fighting for his life Born late, his arrival put both him and his mother at extreme risk Swiftly, treatment began, stabilizing his breathing and battling the infectionYour donations meant everything to AdnanLinks:","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Your Donations Are Saving Newborn Lives! ","body":"Dear Supporter,We want to extend our deepest gratitude to you for your past support, which has already made a significant difference in the lives of many newborns in northern Syria. Thanks to your generosity, we have been able to save dozens of babies who were critically ill and in need of urgent care in our hospitals.Today, we want to share with you the story of Mohammad, a baby facing life-threatening challenges. Born with a severe chest deformity, Mohammad's tiny body relies on artificial ventilation, and his life is at risk without continued medical intervention. Every day, his situation remains fragile, and we urgently need your support to provide the life-saving care he requires.Your ongoing contributions are vital, not only for Mohammad but for many other newborns who depend on us for survival. With your help, we can continue to provide the intensive care they need to overcome these critical moments and give them a fighting chance at life.Please join us in ensuring Mohammad, and other vulnerable babies, get the chance they deserve. Together, we can continue to save lives in northern Syria.Thank you once again for your generosity and compassion.Links:","teaser":"Dear Supporter,We want to extend our deepest gratitude to you for your past support, which has already made a significant difference in the lives of many newborns in northern SyriaToday, we want to share with you the story of Mohammad, a baby facing life-threatening challengesLinks:","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Together for Ritaj and Ahmad: A Story of Survival! ","body":"Dear Supporter,As the cold winter settles over northern Syria, twin newborns, Ritaj and Ahmad, came into this world under heart-wrenching circumstances. Born two weeks early, their tiny, fragile bodies barely visible—Ritaj weighed just 1,170 grams, and Ahmad 1,400 grams—struggled to breathe, too delicate to feel the warmth of love or the comfort of their mother’s embrace.At one of SEMA Hospitals, they were placed on respiratory support, each day a testament to their resilience and a small miracle in their journey.Through the grace of God and your generosity, our doctors were able to help them breathe independently. Their little bodies have started to accept nourishment, and soon, they will gain enough strength to leave the hospital and go home.Ritaj and Ahmad represent countless children waiting for a lifeline. Your support brings hope, proving that compassion and mercy still light up this world.With heartfelt gratitude,Links:","teaser":"Dear Supporter,As the cold winter settles over northern Syria, twin newborns, Ritaj and Ahmad, came into this world under heart-wrenching circumstancesAt one of SEMA Hospitals, they were placed on respiratory support, each day a testament to their resilience and a small miracle in their journey","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"post@david-dicke.de","title":" The rainy season has started, let's reforest! ","body":"Hello everyone! We hope you are well! First of all we want to thank you for supporting our forest restoration. The rainy season has started, there's been a lot of water here, which is great for our forests and the seedlings that are being planted. We have made a video to show you some of this work and to keep you updated. Do you remember that Giving Tuesday is coming up? It's on 3 December. We're counting on your help to continue our reforestation and environmental education work. Happy reading, and have a great week!Iracambi helps restore a 10,000 square metre agroforestry areaThe rains have started and with them a lot of work in the ecological restoration areas of our Forests for Water project. Where there's a tree, there's water! Press play to learn about this work, coordinated by Luiz Gusmão, which covers an area of 10,000 square meters in the community of Graminha, in the municipality of Muriaé, in the Zona da Mata region of southeastern Minas Gerais.After two years of planting native species and many fruit trees, the site is already fulfilling some ecological functions in the restoration process, providing organic matter and attracting wildlife and pollinators. Our team is working with resources from @brazilfound to consolidate this agroforestry. It is worth noting that the fertilizer (manure) used on the trees is purchased from the local community and is a way to help supplement the income of families in the rural area.In 25 years of operation, Iracambi has planted 282,000 native trees and has a total of almost 9,000 hectares of environmental protection, the equivalent of 8,300 soccer fields. It's a lot of love for the forest and for our people. Iracambi is synonymous with preserving the Atlantic Forest, biodiversity and transforming lives.Iracambi takes part in the COP16The founders of our NGO,Binka Le Breton and Robin Le Breton took part inCOP16 Colombia, the UN Biodiversity Conference. With the theme “Peace with Nature”, the event gathered representatives from various sectors - governments, companies, the third sector, activists and civil society - to discuss the conservation of biodiversity and the sustainable use of natural resources, seeking solutions to the planet's most critical challenges.Binka and Robin took part in debates and had the opportunity to share a little about Iracambi's 25 years of experience in restoring the Atlantic Forest in the Zona da Mata region of Minas Gerais, as well as our environmental education, research and volunteering projects. All the actions developed at Iracambi are at the heart of the fight against climate change and our role as agents of change to guarantee biodiversity and a sustainable future for our biome and the planet.Iracambi takes part in course to boost ecotourism We participated in the Tourism Driver Course that took place in Rosário da Limeira, a city in the Zona da Mata (MG), where Iracambi is located, from October 8 to 11. The initiative was promoted by the Faemg/Senar Minas system through the Muriaé Rural Producers' Union, in partnership with the Rosário da Limeira City Hall.The course was taught by tourism expert Gustavo Toledo, who has worked in Iracambi, and was attended by 10 people, including our volunteer/research coordinator Gabriela Soares, and lasted 32 hours. It was an opportunity for a lot of exchange and learning, as the participants were able to visit partner institutions such as Fazenda Iracambi, Verde Aventuras and Fazenda Monte Alegre, and learn on the spot about topics related to tourism, conservation units and entrepreneurship.\"Part of the course took place in Iracambi, and everyone was able to learn a little more about our projects and the potential of tourism. Together we understood the possibilities of each member of the community and what they can offer,\" says our coordinator, Gabriela.As a result, the students created two new tourist itineraries that could be marketed. We thank everyone for this rich experience and we are sure that this course will bear good fruits for the region. Who wants to do ecological and adventure tourism in Iracambi, enjoying the beauty of the Atlantic Forest and the delights of our gastronomy?Links:","teaser":"Hello everyone! We hope you are well! First of all we want to thank you for supporting our forest restoration The rainy season has started, there's been a lot of water here, which is great for our forests and the seedlings that are being planted It's a lot of love for the forest and for our people","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"post@david-dicke.de","title":" The great biodiversity of the Atlantic Rainforest ","body":"Hello everyone! We hope you are well! First of all we want to thank you for supporting our forest restoration. Do you remember that Giving Tuesday is coming up? It's on 3 December. We're counting on your help to continue our reforestation and environmental education work. We'd like to share some incredible images of the biodiversity of the Atlantic Rainforest here at the NGO. Happy reading, and have a great week!The richness of fauna through the eyes of a volunteerOn World Animal Day, celebrated on October 4th, we share with you the richness of some of the fauna of our Atlantic Forest biome here in Iracambi through the eyes of volunteer Isabel. Isabel has been with us for just over a month and is capturing beautiful and valuable images of the animals. In this video, she tells us a little about this close contact with the fauna in her daily life. Thank you, Isa, for this beautiful and powerful work! The Atlantic Rainforest is one of the most biodiverse biomes on the planet, with 6,498 catalogued animal species, 2,001 of which are endemic (found only in a specific region). It is also one of the most threatened. Of the 1,253 species on the list of endangered fauna in Brazil, 507 are from the Atlantic Forest (7.8%), of which 328 are endemic. The data comes from the Biodiversity Extinction Risk Assessment System of the Chico Mendes Institute for Biodiversity Conservation (ICMBio).The presence of animals in Iracambi is one of the indicators of the health of the ecosystem, biodiversity, and reflects 25 years of work in forest restoration, environmental conservation, natural resource management, research and education for sustainability. https://www.instagram.com/reel/DAs91zVus7z/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==Cameras trap monitor the presence of animals in the forestLet’s take a look at the forest? On September 22, when Fauna Defense Day is celebrated, we’re sharing with you a little about the Intelligent Forests project, developed here in Iracambi to monitor the health of the forest. In this video, volunteer coordinator Gabriela Soares shows how biodiversity in the Atlantic Forest is monitored using trap cameras.These are camera traps placed at strategic points and used to take a closer look at the fauna, i.e. the presence of animals in the forest. Hit play and see how the cameras work with Gabi! The information on fauna obtained through the camera traps is just one part of an extensive diagnosis of the forest ecosystem, which also includes data on vegetation, soil, water, climate and sounds.This work allows us to quantify and monitor changes, as well as develop scientifically validated, data-based reference conditions for forest restoration. Pretty cool, right?https://www.instagram.com/reel/DAOSvwcuBpu/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==Bush dogs caught on camera in the forestDid you want to see images of the fauna captured by our camera traps? Then play and check out two videos of this pair of bush dogs (Cerdocyon thous) recorded by the camera trap installed in the forest.The information on fauna provided by the camera traps is just one part of a comprehensive diagnosis of the forest ecosystem, which also includes data on vegetation, soil, water, climate and sounds. The presence of animals is an important indicator of biodiversity. Did you know that? Bush dogs usually travel in pairs and are nocturnal. They measure between 57 cm and 77 cm in length. Their tails vary from 22 cm to 41 cm. They weigh between 4.5 kg and 8.5 kg. Their coat is light gray and they have dark legs and rounded ears. Every tree planted is a step toward a balanced ecosystem and the preservation of the species that call these areas home.https://www.instagram.com/reel/DAWZNSLvlxL/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==","teaser":"Hello everyone! We hope you are well! First of all we want to thank you for supporting our forest restoration Do you remember that Giving Tuesday is coming up? It's on 3 December We're counting on your help to continue our reforestation and environmental education work8%), of which 328 are endemice","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"post@david-dicke.de","title":" Great news from the AtLantic Forest in Iracambi ","body":"Hello everyone! We hope you are well! First of all we want to thank you for supporting our forest restoration. We would like to share with you some hot news that happened in Iracambi in the last few days. Happy reading, and have a great week!Bush dog reintegrated into nature in IracambiHit play and check out the EcoRioMinas coordinated bush dog rehabilitation effort that took place here in Iracambi. The animal was quickly rescued by the company concessionaire of the BR-116 highway and sent to the CTV Veterinary Clinic in Muriaé (MG) for 22 days of treatment and rehabilitation.Fully recovered after treatment, the canid was transferred to our NGO on August 20, when teams from EcoRioMinas, the clinic and Iracambi accompanied its release into the forest.The animal joins other individuals of its species in our area of the Atlantic Forest, which have already been identified by the surveillance cameras installed in the forest. EcoRioMinas and the National Land Transport Agency (ANTT) emphasize their commitment to the conservation of wildlife and the reduction of accidents involving animals on highways.https://www.instagram.com/reel/C_iqHHjuygG/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==Two saruá monkeys are photographed near the Iracambi headquartersWe would like to share beautiful photos of a pair of Guigó-mascarado or black-faced saruá monkeys (scientific name: Callicebus nigrifrons).The pictures were taken by our new volunteer Isabel Schoroer, who arrived with Charlotte Brosing. They came from Germany and were greeted with a “welcome” from the animals that were in trees very close to our headquarters here in Iracambi.This species has a black face, hands and feet, and the rest of its body is brownish to orange. In our region we call this monkey Sauá, but it is also known by other names: guigó, japuçá, saá, uaiapuçá, uapuçá, iapuçá, sauá, boca-d’água, zogó, zogue-zogue and calicebo. Isabel Schoroer, thank you so much for these beautiful records! We’re sure you’ll take many more incredible photos. https://www.instagram.com/reel/C_TJKFpOX2I/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==Discover the magic of our nursery, where Atlantic Forest seedlings are plantedEvery forest begins with a seed. In celebration of Arbor Day, September 21, we bring you a series of videos about the Iracambi Nursery, where the “jewels” collected from the forest are stored, weighed, catalogued, germinated, cared for, and then replanted in reforestation projects.The seeds are affectionately called “jewels” because they are precious objects that carry life to perpetuate the native Atlantic Forest species that will be used in our projects, such as Forests for Water.The nursery is full of life and energy. If you’ve ever had the chance to be here, you know what it’s like to feel the magic of the place. Between 2020 and 2023, the Iracambi Nursery will produce 82,400 seedlings of 52 native tree species.This work is essential to perpetuate these species, which are essential for the conservation and biodiversity of the forest. To give you an idea of the importance of this work, it’s worth remembering that Iracambi is part of the Trinational Pact for the Restoration of the Atlantic Forest, made up of some 300 institutions from Brazil, Argentina and Paraguay.The project, which was named a World Restoration Reference by the United Nations (UN) last December, aims to restore 15 million hectares of the Atlantic Forest by 2050. Pretty cool, right? So play along and check out a little bit of our work with coordinator Juliana Vital.https://www.instagram.com/reel/DAJLMmguzoW/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==      ","teaser":"Hello everyone! We hope you are well! First of all we want to thank you for supporting our forest restoration We would like to share with you some hot news that happened in Iracambi in the last few dayshttps://wwwinstagram https://wwwinstagramThe nursery is full of life and energyhttps://www","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Hope Under Siege: Your Support Keeps Life Going in Gaza ","body":"Dear Donor,In this small part of the world, where nearly two million people live, the people of Gaza endure harsh humanitarian conditions, suffering daily under a siege that has continued for years. This blockade deprives them of the most basic necessities of a dignified life, leaving them in a constant struggle for access to water, food, and medical care.In the midst of this hardship, hope remains alive, thanks to the generosity of remarkable people like you. Because of your support, we were able to provide bread to Mr. Samer, one of the survivors from northern Gaza, who fled with the remaining members of his family to temporary shelters in Khan Yunis. Samer lost three of his children and his wife in a devastating airstrike that targeted their neighborhood. Now, he is left with his two daughters, Sahar and Fatima, fighting every day to provide for them and to keep hope alive in their young eyes.Your donations have provided more than bread; they have given Mr. Samer and his family a sense of safety, a reminder that there are people standing with them, even in the most difficult times.This project, aimed at providing bread and other essential needs, is not just about food aid. It is a message of life, hope, and resilience for our besieged people in Gaza. Your continued support means so much; it empowers us to reach more families and children in need and to give them the means to endure this siege. With heartfelt gratitude, we thank you for your generosity and trust in our humanitarian mission. Your support makes a real difference and alleviates the suffering of thousands who rely on you, after God, in these challenging times.Links:","teaser":"Dear Donor,In this small part of the world, where nearly two million people live, the people of Gaza endure harsh humanitarian conditions, suffering daily under a siege that has continued for years Because of your support, we were able to provide bread to MrLinks:","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Your donations bring hope to the family of Osama and Abdul Rahman in Gaza ","body":"Dear Supporter,Today, we write to share with you moments of joy and hope that your generous donations have brought to the lives of the children Osama and Abdul Rahman, who, with their family, found a relatively safe haven after the war forced them to flee their home in northern Gaza. They settled in a shelter on the outskirts of Khan Yunis, where even the simplest needs have become daily challenges.Thanks to your generous support, we were able to provide bread for Osama and Abdul Rahman's family, ensuring they have essential sustenance that brings stability and comfort in these difficult conditions. Your contributions, no matter how modest, plant hope and carry a message of love and solidarity for families struggling for a dignified life.We need your continued support to meet the needs of affected families in northern Gaza, enabling them to live with dignity despite the hardships. Through your generosity, we can extend help to children who deserve to live free from fear and deprivation.Thank you from the heart for your support. You are the light that illuminates their path and brings them a sense of reassurance.With many thanks Links:","teaser":"Dear Supporter,Today, we write to share with you moments of joy and hope that your generous donations have brought to the lives of the children Osama and Abdul Rahman, who, with their family, found a relatively safe haven after the war forced them to flee their home in northern Gaza","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" With Your Support, We Build Hope for Gaza's Affected Families ","body":"Dear Donor,From the heart of suffering and the blockade imposed on Gaza in Palestine, we bring you the impact of your donations, which have become a beacon of hope for those in pain within Gaza.Thanks to your generosity, we were able to provide bread to the family of young Ramez, who fled with his family under heavy bombardment from their home in northern Gaza to seek refuge in a shelter center in the Nawasih area of Khan Yunis. The bread provided by your donations has been a vital support for Ramez's family, offering them a daily meal amid harsh conditions and providing a sense of security and stability in these relentless crises.Your donation is not just assistance; it is a message of solidarity and comfort reaching every heart that has endured loss and suffering. With the ongoing needs of Palestinian families in Gaza, we urge you to continue the support that makes a significant difference in the lives of those in dire need.Thank you from the heart for your generous giving, and thank you for not forgetting Gaza and its people.Links:","teaser":"Dear Donor,From the heart of suffering and the blockade imposed on Gaza in Palestine, we bring you the impact of your donations, which have become a beacon of hope for those in pain within GazaThank you from the heart for your generous giving, and thank you for not forgetting Gaza and its people","charity_project":"Oxfam"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Together, we are improving health for children like Dalia in Guatemala! ","body":"In April 2021, Dalia was diagnosed with acute malnutrition and significant growth delays. She has six siblings, and two other sisters also had faced growth and health challenges. Dalia’s mother, who learned about Wuqu' Kawoq at a Women’s Health workshop, sought help for her daughter through our Family-Centered Nutrition Program. During Dalia’s first evaluation, due to the severity of her condition, she was referred to the Nutritional Recovery Center. But Dalia’s parents were hesitant; they were concerned about leaving their other children during the pandemic. In addition, they had lost trust in the public health system after another daughter who had a similar illness passed away during treatment.Instead, Dalia’s parents enrolled her in Wuqu' Kawoq Family-Centered Nutrition Program, along with our Complex Care Program for further testing and ongoing follow-up. She is believed to have cerebro-oculo-facio-skeletal (COFS) syndrome, a rare genetic condition that affects growth and development.Over time, Dalia’s parents have carefully followed instructions to help their daughter develop and grow stronger. They have been heartened to see progress. Today, she is more active, has gained weight, attempts to speak, lifts her head, and recognizes her family with a smile.Your support is transforming the lives of children like Dalia in Guatemala, and we are deeply thankful for your commitment!","teaser":"In April 2021, Dalia was diagnosed with acute malnutrition and significant growth delays She has six siblings, and two other sisters also had faced growth and health challenges During Dalia’s first evaluation, due to the severity of her condition, she was referred to the Nutritional Recovery Center","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Addressing Child Malnutrition in Rural Guatemala! ","body":"At Wuqu' Kawoq, we provide comprehensive care for patients in Guatemala throughout their lifespan. Our team of physicians, nurses, health educators, community health workers, pharmacists, and drivers collaborates in rural communities to ensure that patients receive the education, continuous care, resources, and emotional support they need to achieve optimal health and well-being. We also collect data on patient health and experiences, which our team analyzes to improve care outcomes.One of our key initiatives is the Family-Centered Nutrition Program. Malnutrition and stunting in early childhood not only pose immediate health threats but also compromise future education, employment, and health prospects. Climate change exacerbates this issue, leading to droughts, floods, and storms that devastate crops.To tackle this critical challenge, our Family-Centered Nutrition Program team works with caregivers of 800 children each year during the first 1,000 days of life to support healthy growth and development. Our nurses and nutrition technicians work closely with families to monitor key developmental milestones and identify sources of healthy, diverse nutrition using locally available foods.Additionally, we collaborate with various government, business, and nonprofit partners to develop sustainable, comprehensive solutions that address the systemic factors driving this national crisis. You are an integral part of this effort—thank you for partnering with us in the fight against rising malnutrition in rural Guatemala.","teaser":"At Wuqu' Kawoq, we provide comprehensive care for patients in Guatemala throughout their lifespan We also collect data on patient health and experiences, which our team analyzes to improve care outcomesOne of our key initiatives is the Family-Centered Nutrition Program","charity_project":"Oxfam"},{"report_type":"article","user":"pguelfi@gmail.com","title":" See the Difference You're Making! ","body":"Guatemala has one of the highest rates of chronic childhood malnutrition in the world, exceeding 70% in some indigenous, rural areas. Recent events, including global inflation, have amplified the problem. According to a December 2022 report from UN OCHA on Guatemala, “Food and nutrition needs are at a historical high.” In February 2023, La Hora reported that the costs of basic foods in Guatemala have increased 17% over the past year.Wuqu’ Kawoq is working with families in rural Guatemala who are most vulnerable to these trends to help reverse child malnutrition and prevent its potential lifelong effects. Our Family-Centered Nutrition Program works one-on-one with families to develop personalized approaches to promote their children’s healthy growth and development. The program includes growth monitoring, in-home nutrition counseling, vitamin and food supplements, and group education classes.In the communities where the program operates, chronic malnutrition has dropped by 20-40%. Alfredo's story is part of the difference that donors are making: Doña Yolanda was concerned that her son Alfredo was underweight, but she was reluctant to contact the local health post for help. Based on her previous experiences, she feared she would be scolded about Alfredo’s poor nutritional status. Then she encountered Blanca Romero, a nutrition technician from Wuqu' Kawoq. Blanca explained that she would visit the family in their home and work with Doña Yolanda in the family language of Mam to create strategies so Alfredo could grow and develop. Doña Yolanda agreed to participate and began making changes to her son’s diet, reducing the use of instant meals and unhealthy snacks and adding supplements and healthier snacks like bananas. Doña Yolanda says that she now feels hopeful that her son will continue to grow and develop so he will be healthy and better able to study and learn in school.You are making a meaningful difference in the lives of Guatemalan children in rural areas, and we are so grateful!","teaser":"Guatemala has one of the highest rates of chronic childhood malnutrition in the world, exceeding 70% in some indigenous, rural areas Recent events, including global inflation, have amplified the problemIn the communities where the program operates, chronic malnutrition has dropped by 20-40%","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Empowering Young Minds: Celebrating the Success of Our Residential Learning Camp ","body":"Dear Supporters,We are excited to share the successful completion of our recent Residential Learning Camp, which provided a transformative experience for 128 out-of-school children from remote tribal areas. These children, many of whom come from rural, financially challenging family situations and are first-generation learners, were able to immerse themselves in a supportive environment focused on both academic and personal growth. Throughout their time at the camp, the children improved their reading, writing, and math skills, building the confidence needed to re-engage with formal schooling. With an emphasis on activity-based learning, they participated in sports, cultural activities, and storytelling, which nurtured a sense of curiosity and a love for learning. The camp also prioritized the children’s health and nutrition, providing nutritious meals and regular health check-ups. This holistic approach has given these vulnerable children the motivation to continue their education and a brighter outlook for the future.We would also like to take this opportunity to invite you to our upcoming event with Fareed Zakaria, entitled “Living in Revolutionary Times.” The event will take place from 6:30 pm to 9:00 pm on Wednesday, October 30, 2024, at 365 Fifth Avenue (at 34th Street), New York.Fareed Zakaria is a bestselling author, renowned host of CNN’s international affairs program “GPS,” and Washington Post columnist. The Chief Executive of Seva Mandir, Mr. Ronak Shah will also be present at this event, and he would be delighted to see you there. Once again, thank you for your continuous support.Thank you,Team Seva Mandir Links:","teaser":"Dear Supporters,We are excited to share the successful completion of our recent Residential Learning Camp, which provided a transformative experience for 128 out-of-school children from remote tribal areas The Chief Executive of Seva Mandir, Mr Once again, thank you for your continuous support","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" An Inspiring Journey of Transformation: From Education to Entrepreneur ","body":"Living in a rural and tribal village in South Rajasthan, Rakesh was a school drop-out and used to rear cattle before joining the Siksha Kendra (Bridge School) run by Seva Mandir. With the support and guidance of the teachers at Siksha Kendra, he improved his learning, reading and writing skills. His enthusiasm for learning enabled him to continue his education and explore opportunities beyond cattle rearing. He regained his interest in education and completed his education with a degree in Arts and also took a basic computer course. He now runs an e-mitra (billing) centre and earns Rs. 15,000 per month.The change in Rakesh's life is evident; not only has he become financially stable, but his family has also been positively impacted. His commitment has inspired his father to overcome his alcohol addiction, and his parents have adopted advanced farming methods learned through Seva Mandir's livelihood programme.Rakesh is also a rural social worker and extends his help to other children in need. Through his work, he not only improves his own life, but also serves as a role model for others in the community.Thanks to supporters like you, Rakesh and many others have found their way in life and have been able to explore opportunities they wouldn't have had otherwise.Thank you again for your continued support!Links:","teaser":"Living in a rural and tribal village in South Rajasthan, Rakesh was a school drop-out and used to rear cattle before joining the Siksha Kendra (Bridge School) run by Seva Mandir With the support and guidance of the teachers at Siksha Kendra, he improved his learning, reading and writing skills","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Donate on July Bonus Day for Rural and Tribal Communities of South Rajasthan! ","body":"We are delighted to share that on April 20th, 2024, we celebrated Seva Mandir's 56th Foundation Day, marking another year of empowering rural communities and fostering sustainable development. Reflecting on a letter from our founder, Dr. Mohan Singh Mehta, written four decades ago, we found his words still resonate, reaffirming our mission's enduring relevance.This milestone is a testament to the unwavering commitment of our supporters, volunteers, staff, and the communities we serve. Together, we have achieved remarkable progress, transforming lives and creating positive change.As we celebrate 56 years of service, we extend our heartfelt gratitude for your continued support and partnership. Your generosity and solidarity drive our success. Through GlobalGiving we at Seva Mandir always feel excited to share about our work, the stories of our village communities and the milestones we reach. In the last year, Seva Mandir has been able to:All of this and so much more we aim to achieve, only with the encouragement and backing we receive from donors like you.Today, we are excited to share our participation in GlobalGiving’s July Bonus Day 2024 Campaign. On July 10, 2024, from 09:00:00 EDT until matching funds run out or 23:59:00 EDT, your donations will be matched by GlobalGiving:Therefore, matching donations will make every contribution count even more, helping us reach even more people in need.We hope you will extend your generous support once again, helping us move closer to our vision of a just, equitable, and sustainable world. Thank you for being an integral part of the Seva Mandir family.Best RegardsLinks:","teaser":"We are delighted to share that on April 20th, 2024, we celebrated Seva Mandir's 56th Foundation Day, marking another year of empowering rural communities and fostering sustainable development Reflecting on a letter from our founder, Dr Your generosity and solidarity drive our success","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Alia and Khaled Stories of Strength Amidst Pain! ","body":"Dear Donor, Just a year ago, Khaled and Alia’s lives changed forever when they lost their father in the devastating bombings in Gaza. Now, all they have is their mother, Fatima, who faces the relentless challenges alone. The family fled to Deir al-Balah, where they now live in a fragile house that barely stands, damaged by previous bombings and at risk of collapsing at any moment.Because of your compassion, we’ve been able to include Khaled and Alia in our sponsorship program, ensuring their basic needs are met. Fatima, their resilient mother, shared her gratitude with us:“Losing my husband was the hardest blow. We suddenly had no breadwinner, and I found myself fighting alone for my children’s safety. Your support has been a lifeline, helping me provide the essentials for their health and growth.”Together, we can continue to bring safety, care, and hope to more children like Khaled and Alia. Your kindness makes all the difference in their lives. With heartfelt gratitude,Links:","teaser":"Dear Donor, Just a year ago, Khaled and Alia’s lives changed forever when they lost their father in the devastating bombings in Gaza Now, all they have is their mother, Fatima, who faces the relentless challenges alone Your kindness makes all the difference in their lives","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Your Support Makes a Difference in Mohammed's Life! ","body":"Dear Donor, Today, we would like to share the story of Mohammed, a ten-year-old orphan whose life has been deeply impacted by your generosity. Mohammed lost his father at a young age, leaving him and his family to face the hardships of life in a camp on the outskirts of Jarabulus in northern Syria. Despite his youth, Mohammed bears the weight of difficult circumstances, witnessing the daily struggles his family endures to secure basic necessities.Thanks to your continued support, we have been able to step in and help Mohammed’s family. Your contributions have allowed us to ease some of their burdens, providing them with essential needs and a sense of security amid uncertainty. Your kindness has given Mohammed not only material assistance but also hope, reminding him that he is not alone.The impact of your support extends beyond meeting immediate needs; it touches the hearts of children like Mohammed and brings stability to families who have lost so much. By continuing to support Mohammed, you are lighting the way for him toward a more hopeful future.Thank you for standing with us and for the invaluable role you play in transforming lives.Links:","teaser":"Dear Donor, Today, we would like to share the story of Mohammed, a ten-year-old orphan whose life has been deeply impacted by your generosity Mohammed lost his father at a young age, leaving him and his family to face the hardships of life in a camp on the outskirts of Jarabulus in northern Syria","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"post@david-dicke.de","title":" Together for Ibrahim: Bringing Hope to Orphaned Lives! ","body":"Dear Donor, We would like to share with you a touching story of one of the orphaned children supported by our Orphan Sponsorship Program, to highlight the impact of your contributions on their lives.Ibrahim, a nine-year-old boy, lost his father when he was just a year old due to a landmine explosion while his father was on his way to work in the agricultural fields near Hreitan city in northern Syria. Since then, Ibrahim, along with his mother and his 13-year-old sister, Sarah, have been living in difficult conditions in a camp on the outskirts of Jarabulus in northern Syria, facing daily challenges and a lack of basic life necessities.Thanks to your generous support, we have been able to sponsor Ibrahim's family, helping them secure essential needs and easing their daily burdens. Your contributions have brought hope into their lives, allowing them to feel a sense of safety and stability once again.Your continued support is essential to our mission to provide care for orphaned children and to give them a chance to live with dignity and to pursue their dreams. We invite you to continue this invaluable support that profoundly impacts their lives, giving them hope for a better future. Thank you for trusting us and for your invaluable generosityLinks:","teaser":"Dear Donor, We would like to share with you a touching story of one of the orphaned children supported by our Orphan Sponsorship Program, to highlight the impact of your contributions on their lives Thank you for trusting us and for your invaluable generosityLinks:","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Angies Graduation ","body":"AngieWith great pride, we want to share with you that Angeles “Angie”, one of the triplets in our family, has recently graduated from college getting a BSc in Industrial Engineering.There are individuals that come to this world with many talents, Angie is one of them. Since she was little, she displayed extraordinary artistic talents, over the years winning several recognitions at school and arts fairs, while at the same time playing musical instruments, but also working on robotics projects. Over time, she also showed abilities in organizing groups, while in high school.Now, with these abilities and accomplishments, she is now facing the challenge of making them fit with whatever job opportunities are available, starting a new independent life living on her own, leaving Puerta Abierta, and planning for the future.She has expressed doubts as to whether she will have what it takes to be successful and plentiful in this new stage of her life.Who hasn´t felt this way sometime along our lives?All Puerta Abierta tutors and Board members will be there to help Angie in her search for personal growth and professional career path decisions, and wish her the best!Links:","teaser":"AngieWith great pride, we want to share with you that Angeles “Angie”, one of the triplets in our family, has recently graduated from college getting a BSc in Industrial EngineeringThere are individuals that come to this world with many talents, Angie is one of them","charity_project":"Oxfam"},{"report_type":"article","user":"pguelfi@gmail.com","title":" 20 years later, 5 university degrees and counting... ","body":"20 Years Later…We are incredibly proud of our girls. Over the past 20 years, Puerta Abierta has provided them with opportunities, and they have grown into amazing young women. But we need your help to continue this mission.Karla joined our home at the age of six, always cheerful and full of life. She is grateful for having a family that supported her through hard times. Today, she works in the human resources department of an auto parts company.Our identical twins, Maria and Angie, have both achieved remarkable milestones. Maria has become a lawyer and lives close by. She often visits after work, stays for dinner, and helps the younger girls with their homework. Angie recently completed her degree in industrial engineering. She is currently searching for a job that will allow her to live an independent and responsible life. She has had several job interviews, and we are hopeful she will find the perfect fit soon.Moni is in the final months of her degree in publicity and marketing. She is planning her graduation party and has already secured a job managing three stores for a healthy food company.But we need your help today. Please donate to Puerta Abierta so we can continue supporting more girls like Karla, Maria, Angie, and Moni in achieving their dreams and experiencing true happiness. Your contribution will directly impact their lives and future success.Today, your donation will be matched until the matching funds are exhausted, so donate now!Donate HereThere is still time to make the dreams of the girls of Puerta Abierta come true. We are counting on you!Links:","teaser":"20 Years Later…We are incredibly proud of our girls Over the past 20 years, Puerta Abierta has provided them with opportunities, and they have grown into amazing young women But we need your help to continue this missionKarla joined our home at the age of six, always cheerful and full of life","charity_project":"Promoting Sustainable Development in India"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Sports, pillar of our education and wellbeing ","body":"It seems that each individual is like a Rubik Cube, we seem to have all the same components, but arranged differently.This similarity is applied to our girls, where we pursue the development of all aspects of their personality, striving to give them the same opportunities, while at the same time discovering and encouraging them to pursue their particular interests. All girls, since early childhood, are looked after in their physical wellbeing, with careful medical care. This includes physical activities, and sports.  They have chosen which sport to practice based on their particular interest and abilities. One of the girls stands out at Tae Kwon Do, which has helped her in her discipline, self-confidence and physical health. Another one is passionate at gymnastics.  They all like to play soccer, some of them are really passionate and good at it. Last week they were part of a dancing festival as a year closing of Amparo Foundation dancing activities. They also have an art workshop every week We have seen that all these achievements and prizes in sports, physical activities and also art, have given them self-confidence, a healthier state of mind, which translates in better behavior, a better environment at home, better grades and more optimism for the future.All of this has also given them a better understanding and more conscience on the importance of keeping a good spiritual, mental and physical health.  This, in due time, will help them heal those wounds and sadness lived early on in their lives.                                                A healthy mind in a healthy body.Links:","teaser":"It seems that each individual is like a Rubik Cube, we seem to have all the same components, but arranged differently All girls, since early childhood, are looked after in their physical wellbeing, with careful medical care This includes physical activities, and sportsLinks:","charity_project":"Oxfam"},{"report_type":"article","user":"post@david-dicke.de","title":" Empowering Education: School Supplies Packed and Ready for REC School ","body":"Behind the scenes - This photo captures Joseph, a member of the team carefully arranging and checking boxes in the trunk of a car. The boxes are filled with a wide range of essential learning materials for distribution to the REC School on Banana Island.Carefully organizing and packing school supplies for schools is a thoughtful, strategic process designed to maximize the impact of each item received. First, we categorize supplies by type—such as notebooks, pencils, pens, rulers, and art materials—to ensure a balanced distribution across all classrooms and grade levels. Each item is inspected to confirm quality and durability, guaranteeing that students receive resources they can rely on throughout the school year.This careful preparation is vital to Develop Africa’s ongoing commitment to supporting education by equipping students in underserved areas with the tools they need to succeed. Despite the logistical challenges of reaching such remote communities, the team’s unwavering determination reflects our mission's core values and heart to make quality education accessible to all.Thank You to Our Generous Donors:  We extend our heartfelt gratitude to each donor who contributed to this effort. Your generosity has allowed us to pack and deliver essential school supplies to the REC School on Banana Island, bringing vital resources directly to students eager to learn. Each box loaded into this car is a testament to your commitment to bridging educational gaps and empowering young learners with the tools they need to succeed. Because of your support, these children are one step closer to building a brighter future.Join Us in Making a Lasting Impact: As we continue this journey to support education in remote communities, we invite you to stay involved. There are countless students across Sierra Leone and beyond who still lack basic learning materials. With your continued support, we can reach even more children and create sustainable change. Consider making another donation, spreading the word, or sharing this report with others who might be inspired to contribute. Together, we can build a brighter tomorrow—one box of supplies at a time. With great appreciation,Amy & the Develop Africa TeamPS.  Does your employer match donations?  Here’s an easy way to find out. Go to https://www.globalgiving.org/matching/Links:","teaser":"Behind the scenes - This photo captures Joseph, a member of the team carefully arranging and checking boxes in the trunk of a car The boxes are filled with a wide range of essential learning materials for distribution to the REC School on Banana Island Go to https://wwwglobalgiving","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Impact Report: The Importance of a Clean and Freshly Painted Nonprofit Office ","body":"Behind the scenes update:For nonprofit organizations, the office is more than a place for staff to work—it serves as a vital point of interaction with beneficiaries. The condition of the office space can directly affect how beneficiaries perceive the organization and the quality of services they receive. A clean and freshly painted office environment enhances their experience, builds trust, and reinforces the organization’s commitment to their well-being.We want our facilities to be attractive and welcoming to our beneficiaries - who come to our office daily for training, counseling, follow-up support, etc.The physical condition of the office reflects the nonprofit’s dedication to its mission and beneficiaries. A freshly painted, well-organized space is a visual representation of the care and attention the organization puts into its work. It communicates that the nonprofit is serious about serving its community and committed to delivering quality services dignifiedly.We recently repainted the entire office space in Sierra Leone.  Having a clean and freshly painted office offers the following benefits:A clean and freshly painted nonprofit office has profound benefits for the staff and the beneficiaries who rely on the organization for support. The office becomes more than just a physical location; it represents the nonprofit's values and mission and plays a pivotal role in the experience of each person who walks through its doors.For beneficiaries, a well-maintained space fosters dignity, trust, safety, and a sense of empowerment. It strengthens their connection to the organization and enhances their overall experience, contributing to the success of the nonprofit’s programs and services. By investing in the upkeep of its office, a nonprofit can create a welcoming, professional environment that truly embodies its commitment to serving the community.We deeply appreciate your continued support!  If you have any questions or need more information, please don't hesitate to email us at GlobalGiving@developafrica.org.    Warm regards,  Amy and the Develop Africa Team     PS.  Does your employer match donations?  Here’s an easy way to find out. Go to https://www.globalgiving.org/matching/Links:","teaser":"Behind the scenes update:For nonprofit organizations, the office is more than a place for staff to work—it serves as a vital point of interaction with beneficiariesThe physical condition of the office reflects the nonprofit’s dedication to its mission and beneficiariesorg Go to https://www","charity_project":"Save the Children"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Empowering Education: Delivering Essential School Supplies ","body":"The Develop Africa team in Sierra Leone is thrilled to receive the latest shipment of barrels filled with school supplies, significantly benefiting hundreds of underprivileged children nationwide. This initiative is vital, as it addresses the critical educational needs of children who often lack access to essential learning materials.The shipment includes essential items such as textbooks, notebooks, pens, pencils, and other vital school supplies for daily learning. By distributing these materials, the team is creating a more equitable educational environment, ensuring that all children—regardless of their background—have the tools they need to excel in their studies.This effort not only supports the academic growth of these children but also instills a sense of hope and motivation, empowering them to pursue their education despite the challenges they face.The photos at the following link show the arrival of the barrels or drums at the Develop Africa office in Freetown, Sierra Leone  - https://developafrica.smugmug.com/2024/Delivering-School-Supplies-to-Children Thank you so much for your support that is helping to get these supplies into the hands of children and youths in Sierra Leone  With appreciation.Amy and the DA teamLinks:","teaser":"The Develop Africa team in Sierra Leone is thrilled to receive the latest shipment of barrels filled with school supplies, significantly benefiting hundreds of underprivileged children nationwidesmugmugAmy and the DA teamLinks:","charity_project":"Oxfam"},{"report_type":"article","user":"post@david-dicke.de","title":" The 2024 International Coastal Clean-up (ICC) in Malaysia ","body":"The International Coastal Clean-up (ICC) Day for 2024 took place worldwide on 21st September. RCM has been coordinating the ICC in Malaysia for several years with the help of many partners and sponsors, as well as thousands of enthusiastic volunteers. This year, a total of 8,356 volunteers gathered at hundreds of locations across Malaysia to remove a whopping 41,014.91kg of trash from beach and underwater clean-ups. The total number of items collected was 388,730! Here is a quick breakdown of the Top 5 items (and how many of them) found during the 2024 ICC: Top 5 Items Beverage Bottles (plastic): 50,785 Cigarette butts: 39,584 Plastic/ foam pieces: 38,801 Grocery bags (plastic): 28,456 Food wrappers (candy, chips, etc): 20,739All of these top 5 items are plastics, and they account for 45.9% of all trash collected for the entire month of September. Marine debris is one of the greatest threats our ocean faces, and clean-up efforts such as the ICC plays a significant role in reducing the amount of damage done to this precious ecosystem. All the data collected is recorded on the Clean Swell app, and it helps scientists and managers around the world make better decisions when it comes to tackling the issue of trash on both a global and national scale. More information about ICC can be found here. A complete report on the 2024 ICC in Malaysia will be released soon on our website and social media channels, so stay tuned!","teaser":"The International Coastal Clean-up (ICC) Day for 2024 took place worldwide on 21st September RCM has been coordinating the ICC in Malaysia for several years with the help of many partners and sponsors, as well as thousands of enthusiastic volunteers91kg of trash from beach and underwater clean-ups","charity_project":"Oxfam"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" Haunting the Seas No More: Ghost Nets Removal ","body":"Ghost nets are fishing nets that are discarded or abandoned by fishermen when they become torn or entangled in reefs. While these nets may seem harmless once left behind, they pose a serious and persistent threat to marine life and ecosystems. Ghost nets continue to \"fish\" for marine animals, leading to entanglement and often death. Turtles, dolphins, sharks, and fish have all been found trapped in these nets. For instance, turtles entangled in ghost nets are unable to surface for air, leading to drowning, while other animals may die from starvation or exhaustion trying to free themselves. Coral reefs, too, suffer significant damage as larger, heavier nets can smother or break them apart. The removal of ghost nets is critical for protecting marine ecosystems, but it must be done carefully to avoid harming delicate coral structures. Heavier nets often require larger teams, significant manpower, and hours of effort to safely retrieve them.Once retrieved, ghost nets are brought ashore for safe and responsible disposal with the assistance of local authorities.Reef Check Malaysia's Local Marine Conservation Groups (LMCG) deal with the removal of ghost nets when they receive reports from the local islanders. Recently, our team in Kota Kinabalu, Sabah partnered the Marine Research Foundation, Sabah Parks, Sabah Dive Rangers and Scuba Junkie SEAS to organise a ghost net removal program in Tunku Abdul Rahman Park. The 3-day program involved recce dives on the first day to verify the location and depth of the ghost nets that were reported, and to mark these sites with buoys. Over the next two days, a team of 25 divers worked hard to remove 141.7kg of ghost nets. These nets were entangled over a vast reef area and our team was able to remove it without damaging the reefs. Your continued support has made these crucial conservation efforts possible. Thank you for helping us move closer to our goal of conserving Malaysia’s marine ecosystems.","teaser":"Ghost nets are fishing nets that are discarded or abandoned by fishermen when they become torn or entangled in reefs While these nets may seem harmless once left behind, they pose a serious and persistent threat to marine life and ecosystems7kg of ghost nets","charity_project":"Providing Education in Afghanistan"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Student Excitement Soars in Hands-On Marine Education Programs ","body":"Our colleagues in the Mersing group of Islands, Johor have been making waves with their education and awareness program for one of the local schools. Recently, 105 amazing 16 year-olds students had the opportunity to participate in a marine sample demonstration and the much-anticipated Winner Announcement of their first assignment entitled \"Marine Organism and Awareness Social Media Content.\"We spent some time watching and reviewing the fantastic and creative video content produced by these students, who worked in teams. Each teams’ work was reviewed and judged based on content, clarity and charisma.In our previous session with these students, we exposed them to the fascinating marine ecosystems: from coral reefs to mangroves to seagrass beds. In this session, we did a quick recap of all these ecosystems and all the students had a chance at hands-on experience in a sample demonstration, bringing these vital topics to life.Following these sessions, we then had narrowed down the group to 40 students, through their success in the Marine Organism and Awareness assignment. These students went on a field trip to learn about marine wildlife sanctuaries and mangrove ecosystems. The content of this trip focused on the role of predators in maintaining ecological balance through interactive presentations and exploration activities.Here's what the students were up to:-      Visited a Marine Wildlife Sanctuary: They participated in an interactive reptile show and received insights from Sarang Buaya Pasir Gudang Wildlife Officer, regarding crocodiles.-      Visited a mangrove ecosystem: They has a chance to explore and observe vital mangrove habitats, and we took this time to highlight the ecological importance of mangroves.We were fortunate to have volunteers from our partner organisation and support from the marine wildlife sanctuary, as well as the local town council, all of whom made this whole educational trip a success. The students had a wonderful time and are looking forward to their next learning adventure with us. ","teaser":"Our colleagues in the Mersing group of Islands, Johor have been making waves with their education and awareness program for one of the local schools\"We spent some time watching and reviewing the fantastic and creative video content produced by these students, who worked in teams ","charity_project":"Emergency Aid in Yemen"},{"report_type":"article","user":"post@david-dicke.de","title":" Empowering women through English language skills ","body":"Empowering Women through English Language SkillsProgram Overview: Prime Educational and Social Trust is dedicated to empowering women with the skills they need to thrive in their communities. Our English Language Program offers women from our vocational training center the opportunity to learn and enhance their English language skills. This program is designed to increase their confidence, employability, and independence, empowering them to build better futures for themselves and their families.Program Objectives: Enhance Communication Skills: Equip participants with essential language skills that enable them to engage confidently in professional and personal settings.Increase Employability: Provide women with the English proficiency needed to pursue better job opportunities, improving their economic independence.Boost confidence and self-esteem: Build participants’ confidence to express themselves and participate actively in the workforce and community life.Facilitate Access to Information: Enable access to educational resources, online platforms, and networking opportunities by breaking language barriers.Program Components:Interactive English Classes: Classes are designed to be interactive, focusing on reading, writing, speaking, and listening skills in practical, real-life scenarios.Professional and Conversational English: Courses cover basic to intermediate English, including vocabulary and phrases for job interviews, workplace communication, and day-to-day conversations.Small Group Learning: Small group classes ensure individual attention, allowing participants to learn at their own pace in a supportive environment.Digital Literacy Integration: Integrating basic digital skills with English training to further support participants' growth in today’s digital world.Program Outcomes: Upon completing the English Language Program, participants will:Gain confidence in communicating effectively in English.Be better prepared for employment in sectors where English language skills are a key asset.Have the skills to continue their English language journey independently or through advanced courses.Program Duration: The program spans three months, with two-hour classes held twice a week.","teaser":"Empowering Women through English Language SkillsProgram Overview: Prime Educational and Social Trust is dedicated to empowering women with the skills they need to thrive in their communitiesBe better prepared for employment in sectors where English language skills are a key asset","charity_project":"Fighting Poverty in Africa"},{"report_type":"article","user":"post@david-dicke.de","title":" Boat Tour for the children of Janani Home ","body":"Boat Tour for the children of Janani HomeThis week, we planned a special outing for the girls from Janani Home – a surprise boat tour through the beautiful mangrove forests! The moment we revealed the destination, excitement filled the air, and the girls couldn’t contain their curiosity and joy. For many, it was their first time on a boat, and their wide-eyed wonder as we cruised through the serene waters and lush green scenery was truly heartwarming to witness.Throughout the tour, the girls eagerly pointed out different plants and birds, and we all shared stories about the importance of protecting such unique natural habitats. The entire experience sparked a sense of adventure and connection to nature in each of them, fostering a deeper appreciation for the environment.By the end of the day, their faces were lit up with smiles, laughter, and memories they’ll cherish. This outing became a shared moment of joy and discovery, reminding us all of the simple yet profound happiness that nature can bring.We look forward to more such experiences that enrich their lives and bring them closer to the world around them.","teaser":"Boat Tour for the children of Janani HomeThis week, we planned a special outing for the girls from Janani Home – a surprise boat tour through the beautiful mangrove forests! The moment we revealed the destination, excitement filled the air, and the girls couldn’t contain their curiosity and joy","charity_project":"Oxfam"},{"report_type":"article","user":"post@david-dicke.de","title":" Chess Training for the Children at Janani Home ","body":"Chess Training for the Children at Janani Home for GirlsAt Janani Home, our commitment to nurturing young minds goes beyond providing shelter and education. We are excited to share that our children have recently begun learning chess, a game that sharpens mental agility, promotes strategic thinking, and boosts confidence—skills that are essential in life beyond the board.The Benefits of Chess for Our ChildrenChess is more than a game; it is a tool for personal development. Through chess, the children are learning patience, focus, and the art of planning ahead. Each move challenges them to think critically and foresee potential outcomes, strengthening their decision-making skills. These lessons translate well into their academic work and everyday lives, enhancing their ability to approach challenges with confidence and creativity.Weekly Sessions with Experienced CoachesUnder the guidance of skilled chess coaches, weekly training sessions are held where children of all skill levels are encouraged to participate. For some, it’s their first time engaging in a structured strategy game, and they’re discovering new talents and interests they didn’t know they had! Coaches use a child-friendly approach, making the sessions engaging and fun while steadily building foundational skills.Positive Impact and Personal GrowthThe transformation in the children’s confidence is inspiring to see. They have shown remarkable enthusiasm, actively discussing strategies with one another and even setting up friendly competitions. Many of them have begun to look forward to the sessions as a highlight of their week, which also contributes to a stronger sense of community among them.Looking Forward: Expanding the ProgramWith the positive impact we’re witnessing, we aim to expand this initiative by introducing more advanced training and hosting small tournaments. This will further engage the children and provide them with an opportunity to compete, celebrate their progress, and learn the importance of both winning and learning from losses.Thank You for Your SupportThis initiative is possible thanks to the generous support from donors like you, who believe in the holistic development of the children at Janani Home. Every donation brings us closer to providing these young minds with experiences that equip them for a brighter future.Thank you for being part of this journey!","teaser":"Chess Training for the Children at Janani Home for GirlsAt Janani Home, our commitment to nurturing young minds goes beyond providing shelter and educationThe Benefits of Chess for Our ChildrenChess is more than a game; it is a tool for personal developmentThank you for being part of this journey!","charity_project":"Emergency Aid in Syria"},{"report_type":"article","user":"pguelfi@gmail.com","title":" Honor Veterans by Helping Their Pets ","body":"At Feeding Pets of the Homeless, we believe in providing essential support to veterans experiencing homelessness, along with the loyal pets who stay by their side. This Veterans Day, we extend our deepest gratitude to those who served our country. Many veterans facing homelessness find solace in the companionship of a pet—a bond that offers them comfort, stability, and a reason to keep going. Since 2008, we have treated the pets of over 550 Veterans. Of those, 209 were in the HUD-VASH program and are now housed.  Leaving 341 Veterans unhoused. Through your generous contributions, we can provide emergency veterinary care, food, and essential supplies for these cherished animals, keeping veterans and their pets together during their hardest times.  The Veteran Pet Support Program: A Lifeline for Heroes and Their PetsOur Veteran Pet Support Program provides veterans with essential resources, including pet food, supplies, spay/neuter services, and vaccines. These services are often critical to helping veterans and their pets secure and maintain housing through HUD-VASH—a federal program focusing on providing housing to the most vulnerable veterans. Thanks to your donations, veterans across the country are gaining the resources needed to establish stability, knowing their pets are cared for too.Success Story: Maxie’s Path to StabilityMeet Maxie—also affectionately known as “Saxie-Maxie”—a 2.5-year-old Shih Tzu whose owner is a disabled veteran participating in the HUD-VASH program. Maxie’s name comes from the movie Maxie, a charming 1980s film. Inspired by the character’s zest and resilience, Maxie’s owner saw her as a fitting companion, especially during tough times.When Maxie’s vaccinations were due, her owner’s housing status with the VA was at risk. Thankfully, their HUD-VASH worker referred them to Feeding Pets of the Homeless. After intake and verification, Maxie was approved for a veterinary visit to update her vaccinations. Feeding Pets of the Homeless contributed $300 toward Maxie’s care, ensuring she could stay by her owner’s side and keep their housing intact.Looking Ahead: Your Support Makes It PossibleEvery story like Maxie’s serves as a powerful reminder of the impact your contributions have on the lives of veterans and their pets. Thanks to your ongoing support, we’re able to extend vital assistance to those who need it most. Through each donation, you make it possible for veterans to face their challenges knowing they won’t lose the companionship of their beloved pets.As we look forward, we invite you to stand with us in ensuring that no veteran—or their loyal pet—is left behind. Thank you for making a difference in so many lives.Links:","teaser":"At Feeding Pets of the Homeless, we believe in providing essential support to veterans experiencing homelessness, along with the loyal pets who stay by their side This Veterans Day, we extend our deepest gratitude to those who served our country  Leaving 341 Veterans unhousedLinks:","charity_project":"Oxfam"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" October: Rising Need for Emergency Pet Care Support ","body":"While October is often filled with autumn celebrations—pumpkin patches, football games, and cozy sweaters—it’s also a reminder of the struggles faced by many who are experiencing homelessness. For them, each day is a challenge, with survival top of mind. But for those with pets, these companions provide crucial emotional support, offering a sense of purpose and comfort in the hardest of times.At Feeding Pets of the Homeless, our Emergency Veterinary Care Program ensures that homeless individuals do not have to watch their beloved pets suffer due to financial hardship. Over the past few months, we’ve seen an increasing number of requests for emergency veterinary care, and while the demand continues to grow, our donations have not kept pace, making it more difficult to keep up with the needs of those who depend on us.Since the beginning of fall, our hotline has been busier than ever, with many calls from people urgently seeking help for their pets. The combination of rising costs and fewer resources has left pet owners scrambling for assistance. Every case represents a pet in need, whether it’s for injuries, illness, or critical treatments that owners simply can’t afford.To date, we have assisted tens of thousands of homeless pet owners in securing vital care for their pets, from vaccinations to life-saving surgeries. Yet, with limited funding, we’ve had to make difficult decisions about which cases we can address immediately and which must wait. The need is great, and the urgency is real.Meet Neveah, a 3-month-old dachshund who recently found herself in a tough situation. Neveah and her owner, who live in their vehicle in a church parking lot, were referred to us by a veterinary office in Grants Pass, OR. Neveah had punctured her eye while exploring, and her owner was devastated to learn that her eye would need to be removed.After contacting Feeding Pets of the Homeless, Neveah's owner completed the intake and homelessness verification process, and Neveah was quickly approved for surgery. A local Veterinary Hospital performed the eye removal, and while Neveah was under anesthesia, they spayed her as well, with her owner's permission.Feeding Pets of the Homeless contributed $1,000 toward Neveah’s care. She’s now on the road to recovery and ready for the next chapter in her journey.Looking ahead, we remain committed to addressing the emergency veterinary needs of homeless pets. We are actively seeking out new partnerships with veterinary clinics to increase our reach and working to identify new funding sources to reduce the waitlist of pets in need.Charitable giving remains one of the most powerful ways for people to support the values they hold dear. Your donations empower us to keep providing life-saving care and to strengthen the human-animal bond that means so much to those experiencing homelessness.We can’t do this alone. We ask that you consider making a donation this October to help us meet the growing need for emergency veterinary care. Your support allows us to continue changing lives, one pet and one person at a time.Thank you for standing with us. Together, we can ensure that pets and their owners stay healthy and united through even the toughest times.Links:","teaser":"While October is often filled with autumn celebrations—pumpkin patches, football games, and cozy sweaters—it’s also a reminder of the struggles faced by many who are experiencing homelessness For them, each day is a challenge, with survival top of mind The need is great, and the urgency is real","charity_project":"Fighting Malnutrition in South Sudan"},{"report_type":"article","user":"momoelgazzar@gmail.com","title":" 34,000 Calls for Help ","body":"It’s the dog days of summer – a time when fundraising slows, but the need for emergency veterinary care keeps growing. Our Emergency Veterinary Care Program has seen a 14% increase in demand, while donations have dropped by 20%. With your support, we’ve continued to address the urgent needs of homeless pet owners, ensuring that their pets receive the critical care they require.Since the start of the year, our hotline has fielded over 34,000 calls—each one representing a person seeking help for their pet. These calls range from requests for veterinary assistance to navigating the process of homelessness verification to finding pet food resources. In total, we have been able to help over 1,140 people and 1,230 pets access vital care, ensuring these pets remain healthy and by their owners' sides.The surge in demand reflects the reality that many homeless pet owners face: rising costs, lack of resources, and the ever-present need for emergency veterinary care. While we’ve been able to help so many, we now have to put pets on a waitlist due to limited funding. The volume of calls and cases shows no signs of slowing, and we need urgent support to ensure that no pet is turned away in their moment of need.Our focus remains on providing life-saving veterinary care to homeless pets, but we need your help. In the coming months, we aim to expand our partnerships with veterinary clinics and find new funding avenues to reduce the waitlist and help more pets. We are also exploring outreach efforts to provide additional support to pet owners who need assistance with food and preventive care.Success Story: KaliahHi there! My name is Kaliah. I’m a 6-year-old Pitbull, and my human and I have been living in our vehicle in Washington for a while now. Life hasn’t been easy, especially because I’ve been dealing with a really bad case of skin mites. I don’t know where they came from, but the itching has been unbearable, and I’ve even started losing some of my fur.My human was really worried and started searching online for help. That’s when she found Feeding Pets of the Homeless. She didn’t waste any time—she got on the phone, and soon after, a case manager helped us complete an intake and verify our situation.After my exam, I was given antibiotics, medication for dermatitis, mousse to help my coat, and some drops to soothe my skin.Feeding Pets of the Homeless contributed $1,091 towards my care. Thanks to their help, I’m feeling so much better, and my human and I are beyond grateful.Owner Thanks: “I wanted to say thank you again so much for helping Kaliah. She seems to be doing so much better now, and I’m just so thankful, and I know she is too!! You guys are amazing!”As we navigate these challenging times, we are deeply grateful for the generosity of our supporters. We ask that you consider making a donation this September to help us wth new cases. With your help, we can prevent more pets from suffering and keep them healthy and safe with their owners.Thank you for continuing to believe in the power of the human-animal bond and for standing with us through these trying times. Your support changes lives; together, we can ensure that homeless pets receive the care they deserve.Links:","teaser":"It’s the dog days of summer – a time when fundraising slows, but the need for emergency veterinary care keeps growing Our Emergency Veterinary Care Program has seen a 14% increase in demand, while donations have dropped by 20%Success Story: KaliahHi there! My name is KaliahLinks:","charity_project":"Fighting Poverty in Africa"}]